[
    {
        "source_file": "S-P 30-L1991 Riba Case-28.04.2022.pdf",
        "Page count": 318,
        "Court Name": "Federal Shariat Court of Pakistan",
        "Case Title": "Shariat Petition No.30-L of 1991 & All other 81 connected matters relating to Riba/Interest",
        "Case Number": "30-L of 1991",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "M/s. Farooq Brothers Vs. UBL, etc.",
        "Advocate Names for each party": "For petitioners: Dr. Aslam Khaki, Advocate, supported by Mrs. Yasmeen Haider, Advocate, Mr. Qaiser Imam, Advocate, etc. For respondents: Mr. Khalid Javed Khan, Attorney General for Pakistan, Mr. Anwar Mansoor Khan, Ex-Attorney General for Pakistan, etc.",
        "Judge Name(s)": "MR. JUSTICE MUHAMMAD NOOR MESKANZAI, CHIEF JUSTICE, MR. JUSTICE DR. SYED MUHAMMAD ANWER, MR. JUSTICE KHADIM HUSSAIN M. SHAIKH",
        "Hearing Date": "Not mentioned in the document",
        "Decision/Order Date": "28.04.2022",
        "Outcome of the Application": "Not mentioned in the document",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The case involves the determination of the legality of Riba/Interest in banking and financial transactions under Islamic law, with significant implications for the financial system in Pakistan." 
    },
    {
        "source_file": "S.P.03-I-2016.pdf",
        "Page count": 45,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Shariat Petition No. 03/I of 2016",
        "Case Number": "03/I of 2016",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Punjab Protection of Women against Violence Act, 2016",
        "Applicant and Respondents": "1. Professor Muhammad Ibrahim Khan (Advocate), 2. Saifullah Gondal (Advocate) vs Province of Punjab through its Secretary, Ministry of Law, Punjab Secretariat, Lahore.",
        "Advocate Names for each party": "1. Professor Muhammad Ibrahim Khan, 2. Saifullah Gondal for Petitioners; Raja Muhammad Jawad Arsalan, Ms. Amna Ali, Mr. Tariq Ismail, Ms. Muneeza Manzoor Butt for Respondents.",
        "Judge Name(s)": "MR. JUSTICE DR. SYED MUHAMMAD ANWER, ACTING CHIEF JUSTICE; MR. JUSTICE KHADIM HUSSAIN M. SHAIKH",
        "Hearing Date": "14.11.2022",
        "Decision/Order Date": "29.11.2022",
        "Outcome of the Application": "Not mentioned in the document",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The petitioners challenged several provisions of the Punjab Protection of Women against Violence Act, 2016, arguing it is discriminatory and against the family system, while the court upheld the law's compliance with Islamic injunctions." 
    },
    {
        "source_file": "S.P.05-I_2020.pdf",
        "Page count": 107,
        "Court Name": "Federal Shariat Court of Pakistan",
        "Case Title": "Hammad Hussain son of Muhammad Hussain Pervez Butt vs. Federation of Pakistan and others",
        "Case Number": "Shariat Petition No.5/I of 2020",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Transgender Persons (Protection of Rights) Act, 2018",
        "Applicant and Respondents": "Applicant: Hammad Hussain; Respondents: 1. Federation of Pakistan, 2. Ministry of Human Rights, 3. SAFFR, 4. Nayyab Ali",
        "Advocate Names for each party": "For Petitioners: Mr. Kamran Murtaza, Mr. Rizwan Aijaz, Mr. Imran Shafique, Mr. Umar Farooq Malana, Mr. Mazhar ul Haq Hashmi, Mr. Abdur Rehman, Mr. Muhammad Younas Mayo, Syed Sikander Abbas Gillani, Mr. Faiz Rasool Jalbni, Ch. Ehsan Majeed Gujjar, Mr. Ghulam Mujtaba Ch., Ms. Misbah Akram, Orya Maqbool Abbasi; For Respondents: Ch. Ishtiaq Mehrban, Mr. Khaleeq Ahmad, Mian Muhammad Faisal Irfan, Raja Muhammad Jawad Arsalan, Mr. Sarbuland Khan, Ms. Shazeen Abdullah, Mr. Imran Shaukat Rao, Barrister Ahsan Hameed Dogar, Mr. Muhammad Bashar Naveed, Mr. Naseer-ud-Shah, Mr. Zahid Yousif, Mr. Fareed Ahmad Dogar, Mr. Adeel Obaid, Mr. Ghulam Hassan, Ms. Maimana Khattak, Raja Qaiser Mehmood, Mr. Muhammad Hassan, Law Officers, Ministry of Human Rights",
        "Judge Name(s)": "MR. JUSTICE DR. SYED MUHAMMAD ANWER, ACTING CHIEF JUSTICE; MR. JUSTICE KHADIM HUSSAIN M. SHAIKH, JUDGE",
        "Hearing Date": "30.09.2020, 21.10.2020, 18.11.2020, 22.12.2020, 05.05.2021, 27.10.2021, 02.12.2021, 17.01.2022, 17.02.2022, 03.03.2022, 04.03.2022, 24.03.2022, 11.04.2022, 20.09.2022, 18.10.2022, 02.11.2022, 10.11.2022, 24.11.2022, 29.11.2022, 07.12.2022, 13.12.2022, 15.12.2022, 10.01.2023, 17.01.2023, 25.01.2023, 07.02.2023, 15.02.2023, 21.02.2023, 28.02.2023, 02.03.2023, 09.03.2023, 15.03.2023, 22.03.2023, 28.03.2023, 04.04.2023, 06.04.2023, 10.04.2023, 13.04.2023, 26.04.2023, 02.05.2023, 03.05.2023, 06.05.2023, 09.05.2023, 10.05.2023",
        "Decision/Order Date": "19.05.2023",
        "Outcome of the Application": "Not mentioned in the document",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The petitioners challenged various sections of the Transgender Persons (Protection of Rights) Act, 2018 and provisions of the National Database and Registration Authority regarding registration of transgender persons." 
    },
    {
        "source_file": "S.P.16-I-2022.pdf",
        "Page count": 13,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Haji Saif-ur-Rahman Shaheen vs Islamic Republic of Pakistan, Government of Pakistan, etc.",
        "Case Number": "Shariat Petition No. 16/I of 2022",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 10(5) of the West Pakistan Family Courts Act, 1964 (Amended 2015)",
        "Applicant and Respondents": "Applicant: Haji Saif-ur-Rahman Shaheen; Respondents: 1. Islamic Republic of Pakistan, 2. Province of Punjab / Government of Punjab, Khyber Pakhtunkhwa, Sindh, Balochistan, 3. Nighat Yasmeen, 4. Muhammad Hammad Choudhary, 5. Chairman / Secretary Reconciliation Council, Jhang",
        "Advocate Names for each party": "In-person",
        "Judge Name(s)": "MR. JUSTICE IQBAL HAMEEDUR RAHMAN, CHIEF JUSTICE; MR. JUSTICE KHADIM HUSSAIN M. SHAIKH; MR. JUSTICE DR. SYED MUHAMMAD ANWER",
        "Hearing Date": "19.09.2023",
        "Decision/Order Date": "06.10.2023",
        "Outcome of the Application": "Dismissed",
        "Cited Case Laws": "PLD 2022 FSC 25 (Imran Anwar Khan v. Government of Punjab, etc.)",
        "Short Summary of the Case": "The petitioner sought relief against a Family Court's decree of Khula, which was declared ineffective as per Islamic injunctions. The petition was dismissed as not maintainable." 
    },
    {
        "source_file": "S.P.25.10.2021.pdf",
        "Page count": 12,
        "Court Name": "FEDERAL SHARIAT COURT",
        "Case Title": "Mst. Sakeena Bibi Vs. Secretary Law, Government of Pakistan, etc.",
        "Case Number": "SHARIAT PETITION NO. 01/I OF 2017",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 310-A of the Pakistan Penal Code, 1860",
        "Applicant and Respondents": "Petitioners: MST. SAKEENA BIBI, SYED MUSHAHID HUSSAIN, SYED IQBAL HUSSAIN; Respondents: SECRETARY LAW, GOVERNMENT OF PAKISTAN, SECRETARY SAFRON, GOVERNMENT OF PAKISTAN, SECRETARY LAW, GOVERNMENT OF KHYBER PAKHTUNKHWA, GOVERNMENT OF KHYBER PAKHTUNKHWA, CHAIRMAN FCR TRIBUNAL, COMMISSIONER FCR, POLITICAL AGENT, ADDITIONAL DISTRICT MAGISTRATE, SYED IFTIKHAR HUSSAIN, SYED TAHIR HUSSAIN",
        "Advocate Names for each party": "Petitioner: MR. KHANZADA AJMAL ZEB KHAN, ADVOCATE; State: SYED ASIF JALAL, AAG, KPK, DR. HAFIZ MUHAMMAD TUFAIL, JURIS-CONSULT",
        "Judge Name(s)": "MR. JUSTICE MUHAMMAD NOOR MESKANZAI, CHIEF JUSTICE; MR. JUSTICE DR. SYED MUHAMMAD ANWER; MR. JUSTICE KHADIM HUSSAIN M. SHAIKH",
        "Hearing Date": "03.06.2021",
        "Decision/Order Date": "25.10.2021",
        "Outcome of the Application": "Disposed of",
        "Cited Case Laws": "Mohammad Sultan and another Vs. The State and another (2013 PCr.L.J. 950)",
        "Short Summary of the Case": "The petitioners challenged the custom of Swara / Vani as being repugnant to the injunctions of Islam and sought to declare it null and void, along with challenging the decision of the Additional District Magistrate." 
    },
    {
        "source_file": "S.P.No.02-I-2014.pdf",
        "Page count": 32,
        "Court Name": "Federal Shariat Court",
        "Case Title": "M/s Najaat Welfare Foundation vs. Federation of Pakistan and others",
        "Case Number": "Shariat Petition No. 02/I of 2014",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Article 203B and Article 203D of the Constitution of Islamic Republic of Pakistan, 1973; West Pakistan Muslim Personal (Shariat) Application Act, 1962",
        "Applicant and Respondents": "Applicant: M/s Najaat Welfare Foundation; Respondents: 1. Federation of Pakistan, 2. Government of Punjab, 3. Government of Sindh, 4. Government of KPK, 5. Government of Baluchistan",
        "Advocate Names for each party": "Petitioner: Mr. Zafarullah Khan; Respondent 1: Ch. Ishtiaq Mehrban; Respondent 2: Imrana Baloch; Respondent 3: Mr. Ahsan Hameed Dogar; Respondent 4: Barrister Babar Imran; Juris-Consult: Dr. Hafiz Muhammad Tufail",
        "Judge Name(s)": "MR. JUSTICE MUHAMMAD NOOR MESKANZAI, CHIEF JUSTICE; MR. JUSTICE SHAUKAT ALI RAKHSHANI; MR. JUSTICE DR. SYED MUHAMMAD ANWER",
        "Hearing Date": "09.12.2020",
        "Decision/Order Date": "03.02.2021",
        "Outcome of the Application": "Dismissed",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The petitioner challenged certain paragraphs of the Principles of Muhammadan Law as being repugnant to Islamic injunctions, seeking proper legislation on inheritance matters." 
    },
    {
        "source_file": "S.P.No.1-I of 2010.pdf",
        "Page count": 158,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Shariat Petition No.01/I of 2007, Shariat Petition No.03/I of 2007, Shariat Petition No.01/I of 2010",
        "Case Number": "01/I of 2007, 03/I of 2007, 01/I of 2010",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sections 5, 6, 7 of the Protection of Women Act, 2006; Sections 376, 496-B, 496-C of the Pakistan Penal Code",
        "Applicant and Respondents": "Applicants: Mian Abdur Razzaq Aamir, Ch. Muhammad Aslam Ghuman, Abdul Latif Sufi; Respondents: Federal Government of Islamic Republic of Pakistan, Federation of Pakistan and others",
        "Advocate Names for each party": "For the Federal Government: Sardar Abdul Majeed, Mr. Tariq Ali, Mr. Muhammad Israr, Syed Hasnain Haider, Syed Azmat Ali Bukhari; For Punjab Province: Mr. Shafaqat Munir Malik, Ch. Saleem Murtaza Mughal; For Sindh Province: Mr. Fareed-ul-Hassan; For N.W.F.P: Mr. Muhammad Sharif Janjua, Mr. Aziz-ur-Rehman; For Balochistan: Mr. Salahuddin Mughal, Mr. Tariq Ali Tahir, Mr. Muhammad Sharif Janjua; Jurisconsults: Hafiz Muhammad Tufail, Dr. Muhammad Hussain Akbar; Amicus curiae: Raja Muqsit Nawaz Khan, Syeda Viquar-un-Nisa Hashmi",
        "Judge Name(s)": "MR. JUSTICE AGHA RAFIQ AHMED KHAN, MR. JUSTICE SYED AFZAL HAIDER, MR. JUSTICE SHAHZADO SHEIKH",
        "Hearing Date": "29-1-2008, 13-3-2008, 25-3-2008, 7-5-2008, 18-11-2008, 5-1-2009, 20-1-2009, 11-2-2009, 2-4-2009, 29-3-2010, 19-4-2010, 17-5-2010, 26-5-2010, 5-7-2010, 6-7-2010, 26.10.2010, 23.11.2010",
        "Decision/Order Date": "22-12-2010",
        "Outcome of the Application": "Not mentioned in the document",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The judgment disposes of three connected Shariat Petitions challenging sections of the Protection of Women Act, 2006, asserting that they are repugnant to the Injunctions of Islam." 
    },
    {
        "source_file": "S.P.No.61-I-92.pdf",
        "Page count": 288,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Shariat Petition No.61/I of 1992, Shariat Petition No.62/I of 1992, Shariat Petition No.12/I of 1999, Shariat Petition No.4/I of 2004",
        "Case Number": "61/I of 1992, 62/I of 1992, 12/I of 1999, 4/I of 2004",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Pakistan Prison Rules, 1978; Prisons Act, 1894; Code of Criminal Procedure, 1898",
        "Applicant and Respondents": "Dr. M. Aslam Khaki Vs. Federation of Pakistan etc.; Master Ijaz Hussain Vs. Govt. of Pakistan; Capt. Retd. Mukhtar Ahmad Sheikh Vs. Federal Govt. of Pakistan",
        "Advocate Names for each party": "Not mentioned in the document",
        "Judge Name(s)": "Syed Afzal Haider",
        "Hearing Date": "Not mentioned in the document",
        "Decision/Order Date": "Not mentioned in the document",
        "Outcome of the Application": "Various provisions declared repugnant to the Injunctions of Islam; some petitions dismissed",
        "Cited Case Laws": "PLD 1984 FSC 34; PLD 2005 FSC 3; PLD 1987 SC 304; PLD 1965 Karachi 350; 1974 P.Cr.L.J. 249",
        "Short Summary of the Case": "The consolidated judgment addresses challenges to various legal provisions related to prisons, prisoners, and prison discipline, examining their compliance with Islamic principles." 
    },
    {
        "source_file": "Sh-P-No-1-K-2002.pdf",
        "Page count": 75,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Shariat Petition No. 11K of 2002",
        "Case Number": "11K of 2002",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Trust Act, 1882; Code of Civil Procedure, 1908",
        "Applicant and Respondents": "1. Mohtarma Benazir Bhutto, 2. Mrs. Gulzar Ahmed Muslim (Petitioners) vs. Federation of Pakistan through Secretary Finance (Respondent)",
        "Advocate Names for each party": "For the petitioners: Barrister Kamal Azfar, Syed Riaz-ul-Hassan Gillani, Advocate, Sardar Zulqarnain, Advocate, Mr. Rafey Altaf, Advocate. For the Federal Government: Mr. Rizwan Ahmed Siddiqui, Deputy Attorney General, Mr. Aamir Raza Naqvi, Deputy Attorney General, Mr. Muhammad Ashraf Khan Mughal, Deputy Attorney General, Sardar Abdul Majeed, Advocate, Mr. Muhammad Nazir Abbasi, Standing Counsel, Mr. Tariq Ali, Advocate, Mr. Fareed-ul-Hassan, AAG, Sindh, Syed Sajid Ali, Joint Admin Officer Pak P.W.D. Ministry of Housing and Works, Karachi, Mr. Khalid Tepu Rana, Solicitor, Mr. Muhammad Arif, Jurisconsult.",
        "Judge Name(s)": "MR. JUSTICE AGHA RAFIQ AHMED KHAN, CHIEF JUSTICE; MR. JUSTICE SYED AFZAL HAIDER; MR. JUSTICE SHAHZADO SHAIKH",
        "Hearing Date": "15.03.2002; 23.10.2007; 12.02.2008; 26.03.2008; 09.04.2008; 22.10.2008; 20.11.2008; 06.01.2009; 13.01.2009; 11.03.2009; 10.04.2009; 07.04.2010",
        "Decision/Order Date": "15.04.2010",
        "Outcome of the Application": "The petition was accepted and the impugned Martial Law Orders were declared repugnant to the Injunctions of Islam.",
        "Cited Case Laws": "Qazalbash Waqf Vs. Chief Land Commissioner Punjab, PLD 1990 SC 99",
        "Short Summary of the Case": "The petitioners challenged the Martial Law Orders issued against the Peoples Foundation Trust, arguing that these orders were unconstitutional and violated Islamic injunctions. The court ruled in favor of the petitioners, declaring the orders void." 
    },
    {
        "source_file": "Sh-P-No-8-I-2004.pdf",
        "Page count": 41,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Shariat Petition No. 8/I of 2004 and others",
        "Case Number": "8/I of 2004, 6/I of 1994, 8/I of 1994, 12/I of 1994, 69/I of 1994",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicants: Professor Kazim Hussain, Shaukat Ali Awan, Dr. Mehmood-ur-Rehman Faisal, Javed Iqbal, Ch. Munir Sadiq, Dr. Iftikhar Ahmed; Respondents: Government of Pakistan, Attorney General of Pakistan, Secretary Ministry of Finance",
        "Advocate Names for each party": "For the petitioners: Mr. Kowkab Iqbal; For the Federal Government: Mr. Shabbir Mehmood Malik, Mr. Abdul Ghaffar; For Govt. of the Punjab: Ch. Saleem Murtaza Mughal, Mr. M. Javed Ali, Mr. Habib-ur-Rehman; For Govt. of Sindh: Mr. Muhammad Qasim Mirjat; For Govt. of KPK: Mr. Aziz-ur-Rehman, Mr. Amanat Ullah; For Govt. of Balochistan: Mr. Azam Khan Khattak; As Amicus Curiae: Barrister Feroze Jamal Shah Kakakhel",
        "Judge Name(s)": "MR. JUSTICE DR. FIDA MUHAMMAD KHAN, MR. JUSTICE RIZWAN ALI DODANI, MR. JUSTICE SHEIKH AHMAD FAROOQ",
        "Hearing Date": "19.06.2012",
        "Decision/Order Date": "12.12.2012",
        "Outcome of the Application": "Allowed",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The petitioners challenged the legality of certain government rules regarding house rent allowance for married government employees living together, claiming these rules were repugnant to Islamic injunctions. The court ruled that the rules were indeed repugnant and directed necessary amendments." 
    },
    {
        "source_file": "Sh.P.No.17 I of 1984.pdf",
        "Page count": 227,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Capt.(Retd) Abdul Wajid and another Versus Attorney General of Pakistan",
        "Case Number": "Shariat Petition No.2/L of 1984",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Pakistan Penal Code (Act XLV of 1860), Code of Criminal Procedure, 1898 (Act V of 1898), Press & Publications Ordinance, 1963",
        "Applicant and Respondents": "Capt.(Retd) Abdul Wajid and others vs. Attorney General of Pakistan",
        "Advocate Names for each party": "For the Petitioners: Mr. Mujibur Rehman, Capt.(Retd) Abdul Wajid; For the Respondent: Haji Shaikh Ghia Muhammad, Mr. M.B. Zaman, Dr. Syed Riazul Hasan Gillani",
        "Judge Name(s)": "Mr. Justice Fakhre Alam, Mr. Justice Ch. Muhammad Siddique, Mr. Justice Maulana Malik Ghulam Ali, Mr. Justice Maulana Abdul Quddus Qasmi",
        "Hearing Date": "15.7.1984, 16.7.1984, 17.7.1984, 18.7.1984, 19.7.1984, 22.7.1984, 23.7.1984, 24.7.1984, 25.7.1984, 26.7.1984, 29.7.1984, 30.7.1984, 31.7.1984, 01.8.1984, 02.8.1984, 05.8.1984, 06.8.1984, 07.8.1984, 09.8.1984, 11.8.1984, 12.8.1984",
        "Decision/Order Date": "12.8.1984",
        "Outcome of the Application": "The two petitions are without force and are dismissed.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The petitions challenged the constitutionality of an ordinance that restricted the religious practices of the Qadianis, which the court upheld as not interfering with their right to profess and practice their religion." 
    },
    {
        "source_file": "Sh.Pet.No.2 of 1979 L-W others.pdf",
        "Page count": 126,
        "Court Name": "Not mentioned in the document",
        "Case Title": "Not mentioned in the document",
        "Case Number": "Not mentioned in the document",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Not mentioned in the document",
        "Advocate Names for each party": "Not mentioned in the document",
        "Judge Name(s)": "Justice Agha Ali Hyder, Justice Aftab Hussain, Justice Zakaullah Lodi, Justice Karimullah Durrani",
        "Hearing Date": "Not mentioned in the document",
        "Decision/Order Date": "Not mentioned in the document",
        "Outcome of the Application": "Not mentioned in the document",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "Not mentioned in the document" 
    },
    {
        "source_file": "Sh.Pet.No.K-4 of 1982.pdf",
        "Page count": 35,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Shariat Petition No.K-4 of 1982",
        "Case Number": "K-4 of 1982",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Federation of Pakistan and others",
        "Advocate Names for each party": "Mr. Ansar Burney, Mr. M.A. Khalil Siddiqi, Mr. G.M. Saleem, Mr. Sharif ud Din Pirzada, Mr. Khalid M. Ishaq, Mr. Ishrat Ali Khan, Mr. Anwar Ahmad Qadri, Mrs. Rashida Patel, Mrs. Salima Nasir ud Din",
        "Judge Name(s)": "Hr. Justice Aftab Hussain, Mr. Justice Zahoorul Haq, Mr. Justice Malik Ghulam Ali, Chief Justice",
        "Hearing Date": "31.7.1982, 1.8.1982, 5.8.1982, 8.8.1982, 9.8.1982 & 10.8.1982",
        "Decision/Order Date": "10th August, 1982",
        "Outcome of the Application": "Not mentioned in the document",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The case discusses the legitimacy of appointing women as Qazi and the various opinions on the subject based on Islamic jurisprudence." 
    },
    {
        "source_file": "Sh.Petition No.2-I of 2015.pdf",
        "Page count": 22,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Sh. Petition No.2/I of 2015",
        "Case Number": "2/I of 2015",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Farooq Siddiqui (Petitioner) vs Mst. Farzana Naheed (Respondent)",
        "Advocate Names for each party": "Farooq Siddiqui (Petitioner in person), Farzana Naheed (Respondent in person), Mr. M. Parvez Khan Tanoli (Standing Counsel for Federal Government), Syed Raza Abbas Naqvi (Assistant Advocate General Punjab), Mr. Ahsan Hameed Dogar (Advocate for Government of Sindh), Mr. Arshad Ahmad Khan (Assistant Advocate General KPK), Mr. Muhammad Ayaz Khan Swati (Additional Advocate General Balochistan), Dr. Muhammad Yousaf Farooqui & Dr. Muhammad Aslam Khaki (Juris-Consults)",
        "Judge Name(s)": "MR. JUSTICE RIAZ AHMAD KHAN, CHIEF JUSTICE; MR. JUSTICE ALLAMA DR. FIDA MUHAMMAD KHAN; MR. JUSTICE ZAHOOR AHMED SHAHWANI",
        "Hearing Date": "05.05.2015, 21.09.2015, 20.10.2015, 17.11.2015, 25.11.2015, 12.01.2016, 07.03.2016, 19.04.2016, 04.10.2016, 10.01.2017, 01.02.2017 & 16.02.2017",
        "Decision/Order Date": "16.02.2017",
        "Outcome of the Application": "Shariat Petition stands disposed of",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The petitioner, a Pakistani born American citizen, sought custody of a child born through surrogacy, claiming an oral agreement with the respondent. The respondent denied the surrogacy claim, asserting lawful marriage and seeking maintenance for the child. The court examined the legality of surrogacy under Islamic law and the need for legislative amendments regarding surrogacy in Pakistan." 
    },
    {
        "source_file": "Sr.P.No.10.I.of.2020.pdf",
        "Page count": 10,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Farooq Omar Bhoja vs. Federation of Pakistan",
        "Case Number": "Shariat Petition No. 10/1 of 2020",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sections 4, 5 and 6 of the Child Marriage Restraint Act, 1929",
        "Applicant and Respondents": "Applicant: Farooq Omar Bhoja; Respondent: Federation of Pakistan through Ministry of Law and Justice",
        "Advocate Names for each party": "Sayyed Tanvir Sohail for the petitioner; Not mentioned for the respondent",
        "Judge Name(s)": "Mr. Justice Muhammad Noor Meskanzai, Chief Justice; Mr. Justice Dr. Syed Muhammad Anwer; Mr. Justice Khadim Hussain M. Shaikh",
        "Hearing Date": "23.09.2021",
        "Decision/Order Date": "25.10.2021",
        "Outcome of the Application": "The petition is dismissed in limine",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The petitioner challenged the impugned provisions of the Child Marriage Restraint Act, 1929, claiming they contradict Islamic law. The court concluded that the petition was misconceived." 
    },
    {
        "source_file": "Judgment on Riba.pdf",
        "Page count": 297,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Not mentioned in the document",
        "Case Number": "Not mentioned in the document",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Interest Act, 1839; Government Savings Banks Act, 1873; Negotiable Instruments Act, 1881; Land Acquisition Act, 1894; Code of Civil Procedure, 1908; Co-operative Societies Act, 1925; Insurance Act, 1938; State Bank of Pakistan Act, 1956; West Pakistan Money Lenders Ordinance, 1960; Banking Companies Ordinance, 1962; Banking Companies (Recovery of Loans) Ordinance, 1979.",
        "Applicant and Respondents": "Various applicants versus Government of Pakistan and other respondents",
        "Advocate Names for each party": "Hafiz S.A.Rahman, Mr.Iftikhar Hussain Ch., Mr.S.M.Zafar, Mr.Ali Zafar, and others",
        "Judge Name(s)": "MR.JUSTICE DR.TANZIL-UR-RAHMAN, MR.JUSTICE DR.FIDA MUHAMMAD KHAN, MR.JUSTICE ABAID ULLAH KHAN",
        "Hearing Date": "Various dates including 30-6-1990, 11-12-1990, 9-6-1991, and others",
        "Decision/Order Date": "Not mentioned in the document",
        "Outcome of the Application": "Not mentioned in the document",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The case involves challenges to various provisions of fiscal laws related to interest, addressing the compatibility of these laws with Islamic injunctions." 
    },
    {
        "source_file": "Sh.P.No2-I of 2006.pdf",
        "Page count": 24,
        "Court Name": "Federal Shariat Court",
        "Case Title": "Muhammad Aslam Khaki v. Federation of Pakistan",
        "Case Number": "Shariat Petition No.2/I of 2006",
        "Type of Petition or Application": "Shariat Petition",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Prohibition (Enforcement of Hadd) Order (4 of 1979), Constitution of Pakistan (1973), Articles 8 and 25",
        "Applicant and Respondents": "Dr. Muhammad Aslam Khaki - Petitioner; Federation of Pakistan through Ministry of Justice and Parliamentary Affairs - Respondent",
        "Advocate Names for each party": "Sardar Abdul Majeed, Standing Counsel and Tariq Ali for the Federal Government; Allama Shah Tafazul Ali, Maulana Sarfraz Mehmood, Maulana Ibrahim Musa, Muhammad Abdul Manan, Ibrahim Ishaque and Dr. Muhammad Yousaf Farooqui: Juris-consults",
        "Judge Name(s)": "Haziqul Khairi, C.J., Allama Dr. Fida Muhammad Khan, Salahuddin Mirza, Syed Afzal Haider, JJ",
        "Hearing Date": "29th January, 7th May, 27th August, 22nd October, 12th November, 2008, 14th and 15th January, 2009",
        "Decision/Order Date": "28th May, 2009",
        "Outcome of the Application": "Shariat Petition No.2/I of 2006 be dismissed",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The petitioner challenged Articles 8 and 25 of the Prohibition (Enforcement of Hadd) Order, 1979, arguing they were violative of Islamic injunctions. The court upheld the provisions, stating that taking any intoxicant is a major sin in Islam and is strictly prohibited." 
    },
    {
        "source_file": "Sh.P.No.4-I-2016,7-I-2017,4-I-2019 & 3-I-2020.pdf",
        "Page count": 29,
        "Court Name": "Federal Shariat Court of Pakistan",
        "Case Title": "Not mentioned in the document",
        "Case Number": "Not mentioned in the document",
        "Type of Petition or Application": "Shariat Application",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 10 of the Punjab Family Court Act, 2015",
        "Applicant and Respondents": "1. Imran Anwar Khan vs. 2. Government of Punjab",
        "Advocate Names for each party": "1. Sardar Hafeez Khan, Advocate; 2. Imran Khan Judoon, Advocate; 3. Akbar Saeed, Advocate; 4. Mahmood Iqbal Sheikh, Advocate; 5. Dr. Islam Khaki, Advocate",
        "Judge Name(s)": "Justice Noor Muskanzai, Chief Justice; Justice Dr. Syed Noor; Justice Khadim Hussain M. Sheikh",
        "Hearing Date": "Not mentioned in the document",
        "Decision/Order Date": "February 17, 2022",
        "Outcome of the Application": "The amendments in the Punjab Family Court Act, 2015 were declared un-Islamic.",
        "Cited Case Laws": "PLD 2014 FSC 43",
        "Short Summary of the Case": "The case revolves around the legality of amendments made to the Punjab Family Court Act, particularly regarding the provisions related to divorce and the rights of women in the context of Khula." 
    }
]