[
    {
        "source_file": "Appeal_No._1112_of_2015.pdf",
        "Page count": 17,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Ali Dino Kalhoro vs. Deputy Inspector General of Police, Sukkur Range",
        "Case Number": "S.A. No. 1112 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Ali Dino Kalhoro; Respondents: 1. Deputy Inspector General of Police, Sukkur Range; 2. S.S.P. Sukkur Range; 3. The District Accounts Officer",
        "Advocate Names for each party": "Mr. Abdul Jabbar Qureshi, AAG Sindh for respondents",
        "Judge Name(s)": "JUSTICE (R) MUJEEBULLAH SIDDIQUI, CHAIRMAN; MR. AMEER FAISAL, MEMBER-1",
        "Hearing Date": "11.06.2015",
        "Decision/Order Date": "26.06.2015",
        "Outcome of the Application": "The appeal is allowed; the respondent No.3 is directed to release the salary of the appellant w.e.f. December, 2014 onwards.",
        "Cited Case Laws": "Government of Sindh, through Secretary S&GAD V/s. Raja Muhammad Inayat Khan, 2000 SCMR, 1964; Pakistan Railways V/s. Ajmal Khan, 2003 PLC (CS) 1027; Zafar Iqbal Qureshi V/s. Muhammad Ali, 2002 PLC (CS) 1358",
        "Short Summary of the Case": "The appellant, a police constable, sought to withdraw his voluntary retirement due to non-payment of pension and financial benefits. The Deputy Inspector General of Police accepted his appeal on humanitarian grounds, but the District Accounts Officer stopped his salary. The Tribunal ruled that the District Accounts Officer had no authority to stop the salary and directed the release of the appellant's salary and benefits."
    },
    {
        "source_file": "Appeal_No._1144_of_2021.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Rashid vs The Addl: Inspector General of Police",
        "Case Number": "Appeal No. 1144 of 2021",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No.151/2020 u/s:365/A/34 PPC, FIR No.106/2020 Arms Act",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Muhammad Rashid; Respondents: 1. The Addl: Inspector General of Police, 2. The Addl: Inspector General of Police CTD Sindh, 3. The Deputy Inspector General of Police, CTD Sindh",
        "Advocate Names for each party": "Appellant: Mrs. Sumaira Fareed; Respondents: Mr. Imran Ali Jatoi, Mr. Asif Riaz",
        "Judge Name(s)": "Tariq Mehmood Khoso, Dr. Khalil-ur-Rehman Shaikh",
        "Hearing Date": "20.10.2023",
        "Decision/Order Date": "10.11.2023",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "1999 SCMR 451, 2002 SCMR 57, 2007 SCMR 192, 2022 SCMR 1387, 2023 SCMR 1135, judgment dated 11.09.2020 passed in SA No.322/2019",
        "Short Summary of the Case": "The appellant, Muhammad Rashid, was dismissed from service due to his involvement in a criminal case related to kidnapping. He appealed the dismissal, arguing that he was wrongfully accused and had been acquitted in the criminal case. The tribunal found that the dismissal was justified based on departmental proceedings."
    },
    {
        "source_file": "Appeal_No._119_of_2014.pdf",
        "Page count": 36,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Moula Bux Chhachhar vs. The Speaker, Provincial Assembly Sindh and Mr. Usman Ali Chachar",
        "Case Number": "Appeal No.119 of 2014",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Assembly Secretariat (Recruitment) Rules, 1974; Sindh Assembly Secretariat (Appointment, Promotion and Transfer) Rules, 1975; Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Moula Bux Chhachhar; Respondents: 1. The Speaker, Provincial Assembly Sindh; 2. Mr. Usman Ali Chachar",
        "Advocate Names for each party": "Appellant: Mr. Ghulam Sarwar Chandio; Respondent No.1: Mr. S. Kamil Shah, AAG Sindh; Respondent No.2: Mr. Choudhry Muhammad Ashraf Khan",
        "Judge Name(s)": "JUSTICE (R) MUJEEBULLAH SIDDIQUI, CHAIRMAN; AMEER FAISAL, MEMBER-I",
        "Hearing Date": "17.10.2014",
        "Decision/Order Date": "11.11.2014",
        "Outcome of the Application": "The appeal is allowed; the impugned Notification is set aside.",
        "Cited Case Laws": "Syed Abdul Razzaq Shah v. The Speaker Provincial Assembly of Sindh; 2013-SCMR-1752",
        "Short Summary of the Case": "The appellant challenged the re-designation of a non-cadre post to a cadre post, claiming it violated the rules and blocked his promotion prospects."
    },
    {
        "source_file": "Appeal_No._1251_of_2016.pdf",
        "Page count": 10,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Zahid Hussain vs Province of Sindh",
        "Case Number": "Appeal No. 1251 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Zahid Hussain; Respondents: Province of Sindh through Chief Secretary Sindh, Secretary Education & Literacy Department Government of Sindh",
        "Advocate Names for each party": "Mr. Zahid Hussain Hulio (appellant present in person), Ms. S. Kamil Shah AAG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon",
        "Hearing Date": "29.03.2017",
        "Decision/Order Date": "24.04.2017",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Karachi Building Control Authority V/s. Hashwani Sales and Services Limited, PLD 1993 SC 2010; Fida Hussain v. The Secretary, Kashmir Affairs, PLD 1995 SC 701; Zafar Iqbal V/s. Director Secondary Education, Multan, 2006 SCMR 1427",
        "Short Summary of the Case": "The appellant challenged the notification dated 14.10.2014 regarding amendments in recruitment rules, claiming it was arbitrary and against natural justice. The Tribunal dismissed the appeal, stating it was not maintainable in law."
    },
    {
        "source_file": "Appeal_No._129_of_2011.pdf",
        "Page count": 11,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Syed Munawar Ali Shah vs. Chief Secretary, Government of Sindh and others",
        "Case Number": "Appeal No. 129 of 2011",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Syed Munawar Ali Shah; Respondents: 1. Chief Secretary, Government of Sindh; 2. Secretary, Home Department, Government of Sindh; 3. Khalid Pervaiz Shaikh",
        "Advocate Names for each party": "Applicant: Mr. Sartaj Ahmed, Advocate; Respondent No. 3: Mr. Jamil Ahmed Rajpar, Advocate; State Counsel: Ms. Shahida Jatoi",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Ameer Faisal, Member-I",
        "Hearing Date": "01.11.2013",
        "Decision/Order Date": "01.11.2013",
        "Outcome of the Application": "The impugned order was quashed and the matter was remanded to the Chief Secretary for a fresh hearing.",
        "Cited Case Laws": "Muhammad Saeed v. Election Petitions Tribunal, PLD-1957-SC-91; Muhammad Khan and others v. Province of Sindh and others, SBLR-2013-Sindh-1189",
        "Short Summary of the Case": "The appeal was regarding the supersession of Khalid Pervaiz Shaikh in a seniority list and his request for inter-se-seniority, which was allowed by the Chief Secretary without proper judicial process, leading to the appeal being quashed and remanded for a proper hearing."
    },
    {
        "source_file": "Appeal_No._1308_of_2021.pdf",
        "Page count": 11,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Pervaiz Akhtar vs. Secretary, Home Department and others",
        "Case Number": "Appeal No. 1308 of 2021",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "FIR No. 13/2021, registered on 07.07.2021",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Pervaiz Akhtar; Respondents: 1. Secretary, Home Department, Government of Sindh; 2. Inspector General of Police Sindh; 3. Mr. Ziaul Islam Baig",
        "Advocate Names for each party": "Mr. Asif Hussain Mangi, Addl: A.G Sindh along with Mr. Juma Din, PDSP (Legal) and Mr. Ali Muhammad, PI for the respondents",
        "Judge Name(s)": "Tariq Mehmood Khoso, Dr. Khalil-ur-Rehman Shaikh",
        "Hearing Date": "08.11.2023",
        "Decision/Order Date": "05.12.2023",
        "Outcome of the Application": "The instant appeal merits no consideration and is hereby dismissed.",
        "Cited Case Laws": "2013 SCMR 1752, 2000 SCMR 645, 1990 SCMR 1417, 2016 PLC (CS) 569, 2009 SCMR 117, 195 PLC (CS) 1211, PU-1997-TRC-Services-139, 2003 PLC (CS) 906, KLR 1997 Labor & Service Case 199, ANWARUL HAQ Vs. FEDERATION OF PAKISTAN (1995 SCMR 1505), Ali Azhar Khan Baloch Vs. Province of Sindh (2015 SCMR 456)",
        "Short Summary of the Case": "The appellant, Pervaiz Akhtar, challenged the orders regarding his seniority and promotions within the Sindh Police, claiming discrimination in not being sent for training and subsequent promotions compared to his batchmates. The Tribunal dismissed the appeal, stating it was time-barred and lacked merit."
    },
    {
        "source_file": "Appeal_No._1407_of_2015.pdf",
        "Page count": 28,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Nadeem S/o Muhammad Yousuf vs. Inspector General Sindh Police Karachi",
        "Case Number": "Appeal No. 1407 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No.785/2013 dated 23.10.2013",
        "Legal Sections Involved": "Section 324/353/34 PPC, Section 7 of the Antiterrorism Act",
        "Applicant and Respondents": "Applicant: Muhammad Nadeem; Respondents: 1. Inspector General Sindh Police Karachi, 2. The Additional Inspector General Police Sindh, Karachi Region, 3. DIG West Zone Karachi, 4. SSP Headquarter West Zone Karachi",
        "Advocate Names for each party": "Mr. Muhammad Wakeel uddin for the appellant; Mr. S.Kamil Shah, AAG Sindh for respondents",
        "Judge Name(s)": "JUSTICE (R) MUJEEBULLAH SIDDIQUI, CHAIRMAN; MR. AMEER FAISAL, MEMBER-1",
        "Hearing Date": "23.12.2015",
        "Decision/Order Date": "18.01.2016",
        "Outcome of the Application": "The appellant is directed to be reinstated in service with all back benefits.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Muhammad Nadeem, was removed from service based on a chest measurement failure after sustaining injuries in a police encounter. The tribunal found the removal illegal and reinstated him with back benefits."
    },
    {
        "source_file": "Appeal_No._143_of_2013.pdf",
        "Page count": 35,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Ali Mangan v. The Chief Minister Government of Sindh",
        "Case Number": "Appeal No. 143 of 2013",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Civil Servants (Appointment, Promotion and Transfer) Rules, 1974",
        "Applicant and Respondents": "Muhammad Ali Mangan (Applicant), The Chief Minister, The Chief Secretary, The Additional Chief Secretary (Respondents)",
        "Advocate Names for each party": "Mr. Jamil Ahmed Rajpar (Advocate for the appellant), Mr. S. Kamil Shah (A.A.G. Sindh for respondents)",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Farooq Azam Memon",
        "Hearing Date": "13.03.2014",
        "Decision/Order Date": "27.03.2014",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": [
            "Pakistan v. Muhammad Himayatullah Farukhi, PLD 1969 SC 407",
            "Chief Secretary Sindh v. Sher Muhammad Makhdoom, PLD 1991 SC 973",
            "Chairman, King Edward v. Wasif Zamir Ahmed, 1997 SCMR 15",
            "Mir Ghulam Ali v. Pakistan, 2000 PLC (C.S) 349"
        ],
        "Short Summary of the Case": "The appellant, Muhammad Ali Mangan, appealed against the withdrawal of his appointment as Deputy Superintendent of Police (DSP) on the grounds that it was illegal and not in accordance with the Sindh Civil Servants (Appointment, Promotion and Transfer) Rules, 1974. The Tribunal dismissed the appeal, holding that the appointment was made in violation of the law."
    },
    {
        "source_file": "Appeal_No._144_of_2013.pdf",
        "Page count": 31,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Muhammad Ali Balich vs The Province of Sindh",
        "Case Number": "Appeal No. 144 of 2013",
        "Type of Petition or Application": "Not mentioned in the document",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Muhammad Ali Balich; Respondents: 1. The Province of Sindh, 2. Chief Secretary, Government of Sindh, 3. Additional Chief Secretary, Home Department, Government of Sindh",
        "Advocate Names for each party": "Mr. Farogh Naseem, Advocate for appellant; Mr. S. Kamil Shah, A.A.G along with Mr. Raool Bux Samejo for respondents",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui",
        "Hearing Date": "Not mentioned in the document",
        "Decision/Order Date": "24 July 2013",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Criminal Original Petition No. 89-K etc., judgment dated 12.06.2013",
        "Short Summary of the Case": "The appellant, Muhammad Ali Balich, challenged the notification withdrawing his appointment as Deputy Superintendent of Police (DSP) on the grounds that the decision was discriminatory and violated his rights under the Sindh Civil Servants (Appointment, Transfer and Promotion) Rules, 1974."
    },
    {
        "source_file": "Appeal_No._1462_of_2015.pdf",
        "Page count": 61,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Waseem vs Chief Secretary, Government of Sindh",
        "Case Number": "Appeal No. 1462 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Civil Servants (Probation, Confirmation & Seniority) Rules, 1975",
        "Applicant and Respondents": "Applicant: Muhammad Waseem; Respondents: 1. Chief Secretary, Government of Sindh; 2. Secretary (Services), Government of Sindh; 3. Muhammad Hussain Syed; 4. Shahid Gulzar Sheikh",
        "Advocate Names for each party": "M/s. M.M. Aqil Awan and Muhammad Arshad Khan Tanoli for the appellant; Mr. S. Kamil Shah AAG Sindh for the respondents Nos. 1&2; Mr. Ovais Ali Shah for respondent No.3; Mr. Ghulam Sarwar Chandio for respondent No.4",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Ameer Faisal, Member-I; Mr. Farooq Azam Memon, Member-II",
        "Hearing Date": "03.03.2016",
        "Decision/Order Date": "22.04.2016",
        "Outcome of the Application": "The appeal was not maintainable against the respondent No.4; the appellant's grievance was confined to the grant of seniority to respondent No.3.",
        "Cited Case Laws": "2013 SCMR 1752; 2015 SCMR 456",
        "Short Summary of the Case": "The appellant, Muhammad Waseem, contested the seniority granted to respondent No.3, Muhammad Hussain Syed, claiming it was based on improper application of rules regarding seniority and promotion. The tribunal found that the appellant did not challenge the promotion of respondent No.3 and that the appeal against respondent No.4 was not maintainable."
    },
    {
        "source_file": "Appeal_No._1467_of_2015.pdf",
        "Page count": 62,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Khalid Hassan vs. The Province of Sindh & Others",
        "Case Number": "Appeal No. 1467 of 2015",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of Sindh Service Tribunals, Act, 1973",
        "Applicant and Respondents": "Khalid Hassan (Applicant), The Province of Sindh, Government of Sindh, The Director of School Education (Respondents)",
        "Advocate Names for each party": "Mr. S. Kamil Shah (for Respondents)",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Farooq Azam Memon",
        "Hearing Date": "22.02.2016",
        "Decision/Order Date": "24.03.2016",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Civil Review Petition No. 193 of 2013, Civil Appeals No. 117, 118 and 595 to 613 of 2000",
        "Short Summary of the Case": "Khalid Hassan, a retired High School Teacher, appealed against the decision denying him time scale promotion to BS-19 due to not completing the required length of service. The tribunal found no merit in his claims and dismissed the appeal."
    },
    {
        "source_file": "Appeal_No._1468_of_2015.pdf",
        "Page count": 28,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "M. Imtiazuddin Ahmed vs. The Chief Secretary and The Additional Chief Secretary (Dev)",
        "Case Number": "Appeal No. 1468 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Civil Servants (Appointment, Promotion & Transfer) Rules, 1974",
        "Applicant and Respondents": "M. Imtiazuddin Ahmed (Appellant) vs. The Chief Secretary and The Additional Chief Secretary (Dev) (Respondents)",
        "Advocate Names for each party": "Mr. Muhammad Rafique Khan (Appellant), Mr. S. Kamil Shah (AAG Sindh for Respondents)",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal",
        "Hearing Date": "18.01.2016",
        "Decision/Order Date": "27.01.2016",
        "Outcome of the Application": "Appeal allowed; Provincial Selection Board-II directed to consider proforma promotion",
        "Cited Case Laws": "Iftikharullah Malhi v. The Chief Secretary and another (1998-SCMR-736)",
        "Short Summary of the Case": "The appellant contended that he was not considered for promotion due to oversight before his retirement. The tribunal found that he was entitled to proforma promotion due to administrative errors and directed the Provincial Selection Board-II to consider his case."
    },
    {
        "source_file": "Appeal_No._146_of_2015.pdf",
        "Page count": 33,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Aziz Ahmed Barlas vs Province of Sindh",
        "Case Number": "S.A. No.146 of 2015",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "West Pakistan Civil Service (Executive Branch) Rules, 1964",
        "Applicant and Respondents": "Applicant: Aziz Ahmed Barlas; Respondents: Province of Sindh, Government of Sindh, Muhammad Asim Javed",
        "Advocate Names for each party": "Appellant: Mr. Khalid Mehmood Siddiqui; Respondents: Mr. S. Kamil Shah Asstt: A.G",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal, Farooq Azam Memon",
        "Hearing Date": "27.05.2015",
        "Decision/Order Date": "17.06.2015",
        "Outcome of the Application": "The impugned notification reverting the appellant from BS-18 to BS-17 is set aside and the promotion order is restored.",
        "Cited Case Laws": "Nazeer Ahmed Chakrani V/s. Government of Pakistan and others 2004 SCMR 623",
        "Short Summary of the Case": "The appellant challenged the reversion from BS-18 to BS-17, claiming it was illegal and discriminatory as he had been granted exemption from passing the departmental examination. The tribunal ruled in favor of the appellant, restoring his promotion."
    },
    {
        "source_file": "Appeal_No._1572_of_2015.pdf",
        "Page count": 12,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Aftab Ahmed S/o Sardar Ali Khan Jatoi vs. Secretary of Home Department Government of Sindh & Others",
        "Case Number": "Appeal No. 1572 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Aftab Ahmed; Respondents: 1. Secretary of Home Department Government of Sindh, 2. The Inspector General of Police, Sindh Karachi, 3. The Deputy Inspector General of Police, Training Sindh Karachi",
        "Advocate Names for each party": "Mr. S.Kamil Shah, AAG Sindh for respondents",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal",
        "Hearing Date": "19.01.2016",
        "Decision/Order Date": "28.01.2016",
        "Outcome of the Application": "Promotion order of the appellant dated 22.08.2014 is restored and respondents are directed to implement the promotion orders.",
        "Cited Case Laws": "Suo-Moto Case No.03/2012 & C.P No.492 to 495/2009; Appeal No.128 of 2014, Meraj Anwar Vs. Province of Sindh",
        "Short Summary of the Case": "The appellant, a Head Constable, challenged the order keeping his promotion in abeyance. The Tribunal found the orders by the Inspector General of Police to be without jurisdiction and restored the promotion order."
    },
    {
        "source_file": "Appeal_No._1601_of_2016.pdf",
        "Page count": 9,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Anisa Naz Ansari vs. The Speaker, Provincial Assembly of Sindh and Mr. Abdul Ghaffar Wagan",
        "Case Number": "Appeal No. 1601 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Service Tribunal Act, 1973; Sindh Provincial Assembly Secretariat (Appointment, Promotion & Transfer) Rules, 1975; Sindh Assembly Secretariat (Recruitment) Rules, 1974",
        "Applicant and Respondents": "Applicant: Anisa Naz Ansari; Respondents: The Speaker, Provincial Assembly of Sindh; Mr. Abdul Ghaffar Wagan",
        "Advocate Names for each party": "Appellant: Mr. Ghulam Sarwar Chandio; Respondents: Mr. S. Kamil Shah, AAG Sindh; Mr. Liaquat Ali, Law Officer; Mr. Muhammad Arshad Khan Tanoli for private respondent No.2",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Chairperson; Shoukat Ali Memon, Member-I",
        "Hearing Date": "13.03.2017",
        "Decision/Order Date": "03.04.2017",
        "Outcome of the Application": "Appeal dismissed in limine with no order as to costs",
        "Cited Case Laws": "PLD 1980 SC 951; PLD 1990 SC 692; 1995 SCMR 1505; 2000 SCMR 1669; PLD 2002 SC 101; 2004 SCMR 1426; 2006 SCMR 453; 2011 PLC (Cs) 846; 2014 PLC (Cs) 11; 2011 PLC (Cs) 982",
        "Short Summary of the Case": "The appeal was against the appointment of Respondent No.2 as Assistant Secretary, claimed to be in violation of recruitment rules. The appellant argued her eligibility for the position, but the tribunal dismissed the appeal on grounds of being time-barred and lack of locus standi."
    },
    {
        "source_file": "Appeal_No._1603_of_2016.pdf",
        "Page count": 9,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Waseem Ahmed S/o Abdul Majeed vs. The Deputy Inspector General of Police and The Senior Superintendent of Police",
        "Case Number": "APPEAL NO. 1603 OF 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 324/2004, Not mentioned in the document",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance 2000",
        "Applicant and Respondents": "Applicant: Waseem Ahmed; Respondents: The Deputy Inspector General of Police, The Senior Superintendent of Police",
        "Advocate Names for each party": "Mr. Sumaira Fareed for the appellant; Mr. S. Kamil Shah, AAG Sindh for respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon",
        "Hearing Date": "10.03.2017",
        "Decision/Order Date": "24.03.2017",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Waseem Ahmed, challenged his dismissal from service based on allegations of misconduct and poor service record. The tribunal upheld the dismissal, stating that the appellant had a history of misconduct and was not fit for service."
    },
    {
        "source_file": "Appeal_No._164_of_2013.pdf",
        "Page count": 53,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Syed Abdul Razzaq Shah vs. The Speaker, Provincial Assembly Sindh & Others",
        "Case Number": "S.A. No.164 of 2013",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of Sindh Service Tribunal Act, 1973",
        "Applicant and Respondents": "Applicant: Syed Abdul Razzaq Shah; Respondents: 1. The Speaker, Provincial Assembly Sindh, 2. The Secretary, Provincial Assembly Sindh, 3. Mr. Ghulam Muhammad Umar Farooq, 4. Muhammad Hanif Burero",
        "Advocate Names for each party": "Mr. Muhammad Ibrahim Sahito for appellant; Mr. S. Kamil Shah, Mr. Liaquat Ali Kalwar for respondents 1, 2, & 3; Mr. Ali Akbar Sahito for respondent No.4",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal",
        "Hearing Date": "13.02.2014",
        "Decision/Order Date": "25.02.2014",
        "Outcome of the Application": "The appeal is allowed and the impugned Notification dated 13th March, 2013 is set aside.",
        "Cited Case Laws": "(1) 2006 SCMR 453, (2) 2004 SCMR 1426, (3) 1995 SCMR 1505, (4) PLJ 1990 S.C (AJK) 38",
        "Short Summary of the Case": "The appellant challenged the change of nomenclature of the post of Data Processing Officer to Assistant Secretary, claiming seniority and alleging discrimination. The tribunal found the Finance Committee's decision to be beyond its mandate and set aside the impugned Notification."
    },
    {
        "source_file": "Appeal_No._172_of_2013.pdf",
        "Page count": 9,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Abdul Latif Mughal (Under Suspension) vs. Chief Secretary, Govt. of Sindh, et al.",
        "Case Number": "Appeal No. 172 of 2013",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of Sindh Service Tribunal Act, 1973; Removal From Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Abdul Latif Mughal; Respondents: Chief Secretary, Govt. of Sindh; Secretary, Services Department, Govt. of Sindh; Secretary to Govt. of Sindh / Administrative Secretary, Education & Literacy Department",
        "Advocate Names for each party": "Mr. Ansari Abdul Lateef for the appellant",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal",
        "Hearing Date": "27.11.2013",
        "Decision/Order Date": "27.11.2013",
        "Outcome of the Application": "The appeal is dismissed in limine.",
        "Cited Case Laws": "E.F.U General Insurance Company Limited Vs. Federation of Pakistan PLD 1997 S.C. 700; A.H. Shah Vs. Electrical Equipment Manufacturing PLD 1979 Lahore 603",
        "Short Summary of the Case": "The appellant challenged an order of suspension under the Removal From Service (Special Powers) Sindh Ordinance, 2000. The Tribunal held that the appeal was not maintainable under the Sindh Service Tribunal Act, 1973 as it was confined to orders under section 9 of the Ordinance."
    },
    {
        "source_file": "Appeal_No._173_of_2014.pdf",
        "Page count": 47,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Ms. Zulekhan W/o Abdul Shakoor vs The Inspector General of Police Sindh",
        "Case Number": "Appeal No.173 of 2014",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Ms. Zulekhan, Respondents: The Inspector General of Police Sindh, The Deputy Inspector General of Police, Sukkur Range",
        "Advocate Names for each party": "Mr. Moula Buksh Khoso for the appellant; Mr. S. Kamil Shah, A.A.G., Ms. Shahida Jatoi, Dr. Mazhar Ali Shah, Mr. Fida Hussain Solangi, PI Musadiq Amjad for respondents",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal",
        "Hearing Date": "09.12.2014, 22.12.2014, 12.01.2015, 19.01.2015",
        "Decision/Order Date": "26.01.2015",
        "Outcome of the Application": "The appeal is allowed; the impugned order dated 10.04.2014 is set aside; the promotion order of the appellant is restored.",
        "Cited Case Laws": "Government of Pakistan v. M/s Village Development Organization, 2005 SCMR 492; Anound Power Generation Ltd. v. Federation of Pakistan, PLD 2001 SC 340",
        "Short Summary of the Case": "The appellant challenged her reversion from the rank of Sub-Inspector to Assistant Sub-Inspector, arguing that her promotion was regular and should not have been revoked without due process. The tribunal ruled in favor of the appellant, restoring her rank and promotion."
    },
    {
        "source_file": "Appeal_No._177_of_2016.pdf",
        "Page count": 10,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Mahi Bux Bhatti vs. The Chief Minister, Government of Sindh, et al.",
        "Case Number": "177 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Mahi Bux Bhatti; Respondents: The Chief Minister, The Chief Secretary, The Secretary Finance, Government of Sindh",
        "Advocate Names for each party": "Appellant: Mr. Muhammad Nasir (associate of Mr. Malik Altaf Javed); Respondents: Mr. S. Kamil Shah",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Farooq Azam Memon",
        "Hearing Date": "04.08.2016",
        "Decision/Order Date": "31.08.2016",
        "Outcome of the Application": "The appeal is allowed; the dismissal order is set aside and the appellant is reinstated.",
        "Cited Case Laws": "Saad Salam Ansari V/s. Chief Justice of Sindh High Court, Karachi through Registrar, 2007 SCMR 1726; Shakeel Ahmed V/s. Commandant 502 Central Workshop EME Rawalpindi and another, 1998 SCMR 1970; Zahid Ali, Assistant Excise & Taxation Officer V/s. Secretary, Excise & Taxation Department, 2007 PLC (CS) 413; Aftab Mehdi V/s. Federation of Pakistan through Prime Minister and another 2012 PLC (CS) 280; Muhammad Haleem V/s. General Manager Pakistan Railways, 2009 SCMR 339.",
        "Short Summary of the Case": "The appeal was against the dismissal of Mahi Bux Bhatti from service due to alleged misconduct related to salary disbursements. The tribunal found that a proper inquiry was not conducted, leading to the reinstatement of the appellant."
    },
    {
        "source_file": "Appeal_No._188_&_189_of_2012.pdf",
        "Page count": 33,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Khan Soomro vs Province of Sindh and others",
        "Case Number": "Appeal No. 188 of 2012 and Appeal No. 189 of 2012",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Muhammad Khan Soomro; Respondents: 1. Province of Sindh, 2. Chief Secretary, 3. Secretary to Government of Sindh, 4. Mr. Lal Dino Mangi",
        "Advocate Names for each party": "Appellant: Mr. Ghulam Sarwar Chandio; Respondents: Mr. S. Kamil Shah, Mr. Jamil Ahmed Rajpar",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Mr. Ameer Faisal",
        "Hearing Date": "11.09.2013",
        "Decision/Order Date": "03.10.2013",
        "Outcome of the Application": "Both appeals allowed; impugned orders set aside",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appeals were filed against orders regarding the seniority and promotion of the respondent No.4, Lal Dino Mangi, which were deemed illegal and set aside due to violations of relevant laws and procedures."
    },
    {
        "source_file": "Appeal_No._188_of_2016.pdf",
        "Page count": 22,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Mustafa Faroog Lasi vs. The Inspector General of Police and others",
        "Case Number": "Appeal No. 188 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No.112/2006 U/S 411/34 PPC, FIR No.338/2014 u/s 365/395 PPC",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance 2000, Sindh Police E&D Rules 1988",
        "Applicant and Respondents": "Applicant: Mustafa Faroog Lasi; Respondents: The Inspector General of Police, Deputy Inspector General of Police, Senior Superintendent of Police",
        "Advocate Names for each party": "Mr. Akhtiar Hussain Soomro for the appellant; Mr. S. Kamil Shah, AAG Sindh for respondents",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal, Farooq Azam Memon",
        "Hearing Date": "29.04.2016",
        "Decision/Order Date": "29.04.2016",
        "Outcome of the Application": "Dismissal from service converted to compulsory retirement",
        "Cited Case Laws": "Criminal Petition No.89-K/2014",
        "Short Summary of the Case": "The appellant, Mustafa Faroog Lasi, challenged his dismissal from service based on allegations of a patchy service record and involvement in criminal cases. The tribunal found the proceedings against him to be void due to lack of jurisdiction and procedural errors."
    },
    {
        "source_file": "Appeal_No._197_of_2022.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal Karachi (at Hyderabad Camp)",
        "Case Title": "Manzoor Ahmed vs Province of Sindh",
        "Case Number": "Appeal No. 197 of 2022",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "FIR Nos. 85 & 112 of 2020",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Manzoor Ahmed; Respondents: Province of Sindh, Inspector General of Police Sindh, Deputy Inspector General of Police Hyderabad Range, Senior Superintendent of Police",
        "Advocate Names for each party": "Appellant: Mr. Mumtaz Alam Leghari; Respondents: Mr. Rafique Ahmed Dahri",
        "Judge Name(s)": "Justice (R) Sadiq Hussain Bhatti, Tariq Mehmood Khoso",
        "Hearing Date": "18.08.2023",
        "Decision/Order Date": "07.09.2023",
        "Outcome of the Application": "The appeal is allowed; original and appellate orders are set aside; the appellant is reinstated in service.",
        "Cited Case Laws": "2023 PLC (C.S.) 928, 2010 SCMR 1546, 2017 SCMR 356",
        "Short Summary of the Case": "The appellant, an ex-inspector of Sindh Police, was dismissed from service due to allegations of misappropriation of case properties. The tribunal found that proper enquiry procedures were not followed and reinstated the appellant, directing a regular enquiry to be conducted."
    },
    {
        "source_file": "Appeal_No._202_of_2012.pdf",
        "Page count": 11,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Ali Soomro vs. The Chief Secretary and others",
        "Case Number": "Appeal No. 202 of 2012",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Muhammad Ali Soomro; Respondents: The Chief Secretary, The Secretary, Mrs. Seema, Ms. Farhat Akhtar, Muhammad Qassim Kumbhar, Muhammad Aslam Kalhoro, Nadeem Ibrahim, Muhammad Shahid, Muneer Ahmed Dehot, Ali Abid Khoso, Riazuddin Ghumro, Mrs. Salma Adil, Rais Ahmed",
        "Advocate Names for each party": "Mr. Jamil Ahmed Rajpar for the appellant; Ms. Shahida Jatoi for A.G. Sindh along with M/s Muhammad Ali Khaskheli and Abdul Majid Memon",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Ameer Faisal, Member-I",
        "Hearing Date": "22.08.2013",
        "Decision/Order Date": "13.09.2013",
        "Outcome of the Application": "Appeal allowed; appellant promoted to Grade-17 with effect from 30.01.1997",
        "Cited Case Laws": "Government of Punjab v. Muhammad Owais Shahid, 1991-SCMR-696; Abdul Qayoom Khan v. Speaker Legislative Assembly, Azad Jammu and Kashmir, 1984-PLC (C.S.)-308; Ahsanullah Sardar v. Secretary to the Government of Punjab, 1987-PLC (C.S.)-144",
        "Short Summary of the Case": "The appellant challenged the exclusion from the seniority list for promotion to BS-18, claiming that he was entitled to be considered for promotion based on his up-gradation to BS-17, which was deemed a promotion under the relevant rules."
    },
    {
        "source_file": "Appeal_No._218_of_2017.pdf",
        "Page count": 12,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Abdullah Sethar S/o Ghulam Qadir Sethar vs. Inspector General of Police and Deputy Inspector General of Police Department",
        "Case Number": "Appeal No. 218 of 2017",
        "Type of Petition or Application": "Appeal under section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Abdullah Sethar; Respondents: Inspector General of Police, Deputy Inspector General of Police Department",
        "Advocate Names for each party": "Mr. Ali Asadullah Bullo for the appellant; Mr. S. Kamil Shah, AAG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon",
        "Hearing Date": "23.05.2017",
        "Decision/Order Date": "07.06.2017",
        "Outcome of the Application": "Appeal stands allowed; appellant reinstated in service",
        "Cited Case Laws": "Nawab Khan & others vs. Government of Pakistan, Executive Engineer GEPCO Limited and another vs. Liaqat Ali, Chief Election Commissioner of Pakistan and others vs. Miss Nasreen Pervez",
        "Short Summary of the Case": "The appellant was dismissed from service for tampering with recruitment results. The tribunal found the dismissal and appellate orders to be invalid due to procedural irregularities and discrimination, leading to the reinstatement of the appellant."
    },
    {
        "source_file": "Appeal_No._2302_of_2016.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Bashir vs. The Home Secretary Government of Sindh and others",
        "Case Number": "Appeal No. 2302 of 2016",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Muhammad Bashir; Respondents: 1. The Home Secretary Government of Sindh, 2. The Inspector General of Police, Sindh Karachi, 3. The Additional Inspector General of Police, Karachi, 4. The AIGP Telecommunication Sindh Karachi",
        "Advocate Names for each party": "Mr. S. Kamil Shah, A.A.G. Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Chairperson; Mr. Shoukat Ali Memon, Member-I",
        "Hearing Date": "30.20",
        "Decision/Order Date": "27.04.2017",
        "Outcome of the Application": "The appeal stands disposed of",
        "Cited Case Laws": "Civil Petition Nos. 493,494, 505 to 508, 529 to 532, 533, 601, 906 and 911 to 917 of 2015 of the Hon’ble Supreme Court",
        "Short Summary of the Case": "The appellant, Muhammad Bashir, challenged his reversion from Sub-Inspector to Head Constable, claiming it was unconstitutional and against natural justice. The tribunal noted the Supreme Court's ruling on the concept of absorption in police service and ultimately disposed of the appeal."
    },
    {
        "source_file": "Appeal_No._2381_of_2016.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Syed Hadi Kareem (Ex-HC/ 1478) vs. G. Police, Sindh and Addl. I.G. Police, Karachi Range",
        "Case Number": "Appeal No. 2381 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 319/2000, Date Not mentioned",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Syed Hadi Kareem; Respondents: G. Police, Sindh and Addl. I.G. Police, Karachi Range",
        "Advocate Names for each party": "Mr. Muhammad Ibrahim M:Sahito for the appellant; Mr. S. Kamil Shah, A.A-G Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Chairperson; Mr. Shoukat Ali Memon, Member-I",
        "Hearing Date": "06.03.2017",
        "Decision/Order Date": "24.03.2017",
        "Outcome of the Application": "Dismissed",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Syed Hadi Kareem, challenged the major penalty of compulsory retirement imposed upon him after being found to have a patchy service record, including prior involvement in criminal cases. The tribunal upheld the original and appellate orders dismissing the appeal."
    },
    {
        "source_file": "Appeal_No._241_of_2017.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Mir Chakar S/o Bakhsho Malik vs The Inspector General of Police",
        "Case Number": "Appeal No. 241 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Mir Chakar S/o Bakhsho Malik; Respondents: 1. The Inspector General of Police, 2. The Deputy Inspector General of Police, 3. The Senior Superintendent of Police, 4. The Deputy Superintendent of Police",
        "Advocate Names for each party": "Mr. Qaim Ali Memon for the appellant; Ms. S. Kamil Shah AAG Sindh along with P.I Jummadin for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon",
        "Hearing Date": "24.04.2017",
        "Decision/Order Date": "24.04.2017",
        "Outcome of the Application": "The appeal was allowed; the impugned orders were set aside, and the appellant was reinstated in service.",
        "Cited Case Laws": "Executive Engineer GEPCO Limited Vs. Liaquat Ali; Pakistan International Airlines Corporation Vs. Abdul Ghafoor & others",
        "Short Summary of the Case": "The appellant, a police constable, was dismissed from service based on allegations of misconduct. The tribunal found that the dismissal was not conducted in accordance with the law, as proper inquiry procedures were not followed, and thus reinstated the appellant."
    },
    {
        "source_file": "Appeal_No._2467_of_2016.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Bashrat Ali S/o Muhammad Saddique vs. The Deputy Inspector General of Police, South Zone Karachi and The Senior Superintendent of Police, District South, Gizri, Karachi",
        "Case Number": "Appeal No. 2467 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 13/2002, 21.02.2004; FIR No. 16/2002, 30.10.2002; FIR No. 88/2003, Not mentioned",
        "Legal Sections Involved": "Section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Bashrat Ali; Respondents: The Deputy Inspector General of Police, South Zone Karachi, The Senior Superintendent of Police, District South, Gizri, Karachi",
        "Advocate Names for each party": "Mr. Sajid Latif for the appellant; Ms. S. Kamil Shah AAG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Chairperson; Shoukat Ali Memon, Member-I",
        "Hearing Date": "31.03.2017",
        "Decision/Order Date": "28.04.2017",
        "Outcome of the Application": "The appeal is dismissed.",
        "Cited Case Laws": "Service Appeal No. 95-K & 96-K of 2016 (Additional Inspector General of Police V/s. Muhammad Ismail Lashari & Muhammad Ishaq Lashari)",
        "Short Summary of the Case": "The appellant, Bashrat Ali, challenged the major penalty of compulsory retirement imposed on him due to his involvement in multiple FIRs and a patchy service record. The tribunal upheld the decision of the competent authority, stating that the appellant was unfit to continue in police service."
    },
    {
        "source_file": "Appeal_No._2470_of_2016.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Akhtar Mehmood vs The Deputy Inspector General of Police, South Zone Karachi",
        "Case Number": "Appeal No. 2470 of 2016",
        "Type of Petition or Application": "Not mentioned in the document",
        "FIR Number and Date": "Crime No. 72/2013, Date Not mentioned",
        "Legal Sections Involved": "Section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Akhtar Mehmood (Appellant) vs 1. The Deputy Inspector General of Police, South Zone Karachi 2. The Senior Superintendent of Police, District South, Gizri, Karachi (Respondents)",
        "Advocate Names for each party": "Mr. Sajid Latif (for the appellant), Ms. S. Kamil Shah AAG Sindh (for the respondents)",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon",
        "Hearing Date": "31.03.2017",
        "Decision/Order Date": "28.04.2017",
        "Outcome of the Application": "The appeal is hereby dismissed.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Akhtar Mehmood, challenged the order of compulsory retirement from service based on his alleged misconduct and patchy service record, despite being acquitted in a criminal case. The tribunal upheld the decision of compulsory retirement."
    },
    {
        "source_file": "Appeal_No._250_of_2012.pdf",
        "Page count": 10,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Mst. Shaheena Firdous w/o Abdul Qayoom Memon vs. The Chief Secretary, Government of Sindh, et al.",
        "Case Number": "250/2012",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Mst. Shaheena Firdous; Respondents: The Chief Secretary, Government of Sindh, The Secretary, Government of Sindh, Education & Literacy Department, The Secretary, Government of Sindh",
        "Advocate Names for each party": "Mr. Jamil Ahmed Rajpar for the appellant; Ms. Shahida Jatoi, State Counsel for A.A.G.",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Ameer Faisal, Member-I",
        "Hearing Date": "19.07.2013",
        "Decision/Order Date": "06.08.2013",
        "Outcome of the Application": "The appeal is allowed; the appellant is entitled to the arrears of her salary.",
        "Cited Case Laws": "Province of Punjab & others v. Syed Muhammad Ashraf, 1973 SCMR 304; Syed Sultan Shah v. Government of Baluchistan & another, 1985 SCMR 1394; Abdul Jabbar Khan v. Government of Sindh through Chief Secretary Sindh & others, 1996 SCMR 850; Iftikharullah Malhi v. Chief Secretary Sindh & another, 1998 SCMR 736; Mrs. Ageela Asghar Ali & others v. Miss Khalida Malik & others, PLD 1991 SC 118",
        "Short Summary of the Case": "The appellant, Mst. Shaheena Firdous, appealed for the payment of arrears of salary after being promoted to Associate Professor (BS-19) from the date she was entitled to be promoted. The Tribunal ruled in her favor, citing precedents that support civil servants' rights to arrears when promotions are delayed."
    },
    {
        "source_file": "Appeal_No._251_of_2017.pdf",
        "Page count": 9,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Urs S/o Hamid Ali Mahar vs The Inspector General of Police",
        "Case Number": "Appeal No. 251 of 2017",
        "Type of Petition or Application": "Appeal under section 4 of the Sindh Service Tribunals Act, 1973",
        "FIR Number and Date": "FIR No. 86/75 U/S 302,364, PPC",
        "Legal Sections Involved": "Sindh Service Tribunals Act, 1973; Police Rules 13-18, Rule 12-2 (3)",
        "Applicant and Respondents": "Applicant: Muhammad Urs S/o Hamid Ali Mahar; Respondents: The Inspector General of Police, Deputy Inspector General of Police",
        "Advocate Names for each party": "Mr. Asif Hussain Mangi, Addl: AG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "13.10.2017",
        "Decision/Order Date": "05-11-2017",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "PLD 1974 SC 393",
        "Short Summary of the Case": "The appellant claimed ante-dated confirmation to the rank of Sub-Inspector, arguing that he was wrongfully confirmed later than his juniors. The tribunal dismissed the appeal, citing the appellant's adverse service record and delay in filing the appeal."
    },
    {
        "source_file": "Appeal_No._2538_of_2016.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Humayun Ahmed vs. The Additional Inspector General of Police, Karachi Range, Karachi Sindh",
        "Case Number": "Appeal No. 2538 of 2016",
        "Type of Petition or Application": "Appeal under section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Humayun Ahmed; Respondents: 1. The Additional Inspector General of Police, Karachi Range, Karachi Sindh; 2. D.I.G.P / Administration for Additional Inspector of Police Karachi Range; 3. The Deputy Inspector General of Police, West Zone, Karachi Sindh",
        "Advocate Names for each party": "Mr. Ghulam Sarwar Chandio for the appellant; Ms. S. Kamil Shah AAG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Chairperson; Shoukat Ali Memon, Member-I",
        "Hearing Date": "14.04.2017",
        "Decision/Order Date": "14.04.2017",
        "Outcome of the Application": "The appeal was allowed; orders dated 19.08.2016 and 13.10.2016 were set aside, and the appellant was reinstated in service.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Humayun Ahmed, challenged the major penalty of compulsory retirement awarded to him based on allegations of misconduct. The tribunal found that the actions taken against him were not in conformity with law and reinstated him in service, directing a de novo inquiry."
    },
    {
        "source_file": "Appeal_No._2540_of_2016.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Irshad Ali Raza vs Province of Sindh & Others",
        "Case Number": "Appeal No. 2540 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Civil Servants (Appointment, Promotion & Transfer) Rules, 1974",
        "Applicant and Respondents": "Applicant: Irshad Ali Raza; Respondents: 1. Province of Sindh, 2. Chief Secretary, Government of Sindh",
        "Advocate Names for each party": "Appellant: Mr. Abid S. Zuberi; Respondents: Mr. S. Kamil Shah, AAG Sindh",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "08.08.2017",
        "Decision/Order Date": "30.08.2017",
        "Outcome of the Application": "The appeal is allowed with the direction to modify the seniority list.",
        "Cited Case Laws": "Criminal Original Petition No. 89/2011",
        "Short Summary of the Case": "The appellant challenged the withdrawal of his promotion as Deputy Superintendent of Police, arguing it was unjust and contrary to the law, leading to the tribunal's decision to restore his seniority."
    },
    {
        "source_file": "Appeal_No._25_of_2016.pdf",
        "Page count": 13,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Ali Hassan S/o Nazeer Ahmed vs Chief Secretary Sindh & Secretary Finance Government of Sindh",
        "Case Number": "Appeal No. 25 of 2016",
        "Type of Petition or Application": "Appeal under section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Ali Hassan; Respondents: Chief Secretary Sindh, Secretary Finance Government of Sindh",
        "Advocate Names for each party": "Mr. Abdul Majeed Khoso for the appellant; Mr. S. Kamil Shah, A.A.G. Sindh for respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Farooq Azam Memon",
        "Hearing Date": "03.08.2016",
        "Decision/Order Date": "Not mentioned in the document",
        "Outcome of the Application": "Major penalty of compulsory retirement imposed upon the appellant enhanced to dismissal from service",
        "Cited Case Laws": "2010 PLC (C.S) 876 Mehtab Ahmed Vs. Chairman National Accountability Bureau, Karachi",
        "Short Summary of the Case": "The appellant, Ali Hassan, challenged the penalty of compulsory retirement imposed due to involvement in embezzlement of government funds. The tribunal found him guilty and enhanced the penalty to dismissal from service."
    },
    {
        "source_file": "Appeal_No._291_of_2018.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Mumtaz Khan Marwat vs. The Additional Inspector General of Police, Karachi Range, Karachi Police Office",
        "Case Number": "Appeal No. 291 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 483/2017 dated 12.11.2017",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973; u/s 302/34 PPC",
        "Applicant and Respondents": "Applicant: Mumtaz Khan Marwat; Respondents: 1. The Additional Inspector General of Police, Karachi Range; 2. The Deputy Inspector General of Police, West Zone",
        "Advocate Names for each party": "Ms. Sumaira Fareed for the appellant; Mr. Asif Hussain Mangi for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "04.09.2018",
        "Decision/Order Date": "08.10.2018",
        "Outcome of the Application": "Appeal allowed; appellant reinstated in service with direction to hold regular inquiry",
        "Cited Case Laws": "PLD 1981 (SC) 179; 1997 PLC (SC) 424; PLD 1977 SC 182; Qazi Faizul Haq V.s N.W.F.P. Through the Chief Secretary 1984 SCMR 451; Chairman, Area Electricity Board, WAPDA, Peshawar V.s Jehangir Khan 1999 SCMR 841; Alamgir V.s Divisional Forest Officer 1993 SCMR 603",
        "Short Summary of the Case": "The appellant, a former SHO, was dismissed from service due to allegations related to a shooting incident involving a minor. The tribunal found that the inquiry was not conducted properly and set aside the dismissal, reinstating the appellant and ordering a regular inquiry."
    },
    {
        "source_file": "Appeal_No._293_of_2017.pdf",
        "Page count": 14,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Muhammad Nadeem vs. Inspector General of Police Sindh & Deputy Inspector General of Police",
        "Case Number": "Appeal No. 243 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Muhammad Nadeem; Respondents: Inspector General of Police Sindh, Deputy Inspector General of Police",
        "Advocate Names for each party": "Appellant: Mr. Ghulam Sarwar Chandio; Respondents: Ms. Khalida Parveen Shaikh, Mr. Ayaz Ali Rajpar, PI Sajjad Hussain, SI Muhammad Nawaz Minhas",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "12.09.2017",
        "Decision/Order Date": "10.10.2017",
        "Outcome of the Application": "Appeal allowed; order dated 10.08.2016 and 17.02.2017 set aside; appellant reinstated in service",
        "Cited Case Laws": "2010 SCMR 1546, 2004 SCMR 1662, 2008 SCMR 1369, Naseeb Khan v. Divisional Superintendent, Pakistan Railways, Lahore (2008 SCMR 1369), Federation of Pakistan through Secretary, Establishment Division Islamabad and another v. Gohar Riaz (2004 SCMR 1662), Mushtaque Ahmed Soomro v. National Bank of Pakistan (2007 PLC (C.S) 180)",
        "Short Summary of the Case": "The appellant, Muhammad Nadeem, challenged his dismissal from service due to alleged misconduct related to a kidnapping incident. The tribunal found that proper inquiry procedures were not followed, particularly regarding the right to cross-examine witnesses, and reinstated the appellant."
    },
    {
        "source_file": "Appeal_No._296_of_2017.pdf",
        "Page count": 16,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Hamid ullah Khan Niazi vs The Inspector General of Police and others",
        "Case Number": "Appeal No. 296 of 2017",
        "Type of Petition or Application": "Appeal against major punishment of compulsory retirement",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance 2000",
        "Applicant and Respondents": "Applicant: Hamid ullah Khan Niazi; Respondents: 1. The Inspector General of Police, 2. The Addl. Inspector General of Police, 3. The Deputy Inspector General of Police",
        "Advocate Names for each party": "Mr. Muhammad Raees Awan for the appellant; Mr. Asif Hussain Mangi, Addl. AG Sindh along with Mr. Ayaz Rajpar, Inspector, Legal Branch, SI Nawaz Minhas and PI Sajjad Hussain for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "Not mentioned in the document",
        "Decision/Order Date": "08.02.2017",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Tahir Khan Vs. DIGP/Administration & another",
        "Short Summary of the Case": "The appellant challenged the major punishment of compulsory retirement imposed on him due to a history of misconduct and adverse service record, which was upheld by the tribunal."
    },
    {
        "source_file": "Appeal_No._299_of_2018.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Iffat Ghazala D/o Mian Muhammad Yousif (Late) vs Province of Sindh and others",
        "Case Number": "Appeal No. 299 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Iffat Ghazala; Respondents: Province of Sindh, Secretary School Education Department, Directorate Schools Education, District Education Officer, Ms. Nasreen D/o Allah Jurio",
        "Advocate Names for each party": "Appellant: Mr. Mian Mohsin Raza; Respondents: Ms. Khalida Parveen Shaikh, Mr. Pervaiz Ahmed Memon, Mr. Ghulam Asghar Mirbahar",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Mr. Shoukat Ali Memon, Mr. Iqbal Ahmad Soomro",
        "Hearing Date": "04.10.2018",
        "Decision/Order Date": "04.10.2018",
        "Outcome of the Application": "Appeal allowed, impugned order set aside",
        "Cited Case Laws": "Anita Turab reported as PLD 2013 (SC) 195",
        "Short Summary of the Case": "The appellant, Iffat Ghazala, challenged her frequent transfers within the education department, claiming they were politically motivated and violated departmental rules. The tribunal found the transfers unjustified and ruled in favor of the appellant."
    },
    {
        "source_file": "Appeal_No._312_of_2017.pdf",
        "Page count": 12,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Razia Khatoon D/o Riazuddin vs. Inspector General of Police, Sindh & Others",
        "Case Number": "Appeal No. 312 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Razia Khatoon; Respondents: 1. Inspector General of Police, Sindh; 2. Additional Inspector General of Police Karachi Range; 3. Deputy Inspector General of Police, Karachi, West Zone",
        "Advocate Names for each party": "For the appellant: Mr. Muhammad Arshad Khan Tanoli; For the respondents: Mr. S. Kamil Shah, AAG Sindh along with Mr. Ayaz Rajper, Incharge (Legal) Branch, AGIP (Legal), PI Mussadiq Amjad and SI Nawaz Minhas",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Chairperson; Shoukat Ali Memon, Member-I",
        "Hearing Date": "24.05.2017",
        "Decision/Order Date": "09.06.2017",
        "Outcome of the Application": "The appeal is allowed",
        "Cited Case Laws": "Muhammad Zikriyal & others vis: Senior Superintendent of Police, Multan, & others, 2003 PLC (CS) 906; Bashir Ahmed Solangi V/s. Chief Secretary, Govt. of Sindh & 2 others, 2007 PLC (CS) 824; Chairman Minimum Wage Board, Peshawar V/s. Fayyaz Khan Khattak, 1999 SCMR 1004; Hameed Akhtar Niazi v. The Secretary, Establishment Division Government of Pakistan, 1996 SCMR 1158",
        "Short Summary of the Case": "The appellant, Razia Khatoon, challenged the withholding of her B-1 examination result due to crossing the age limit. The tribunal ruled in her favor, allowing her appeal and stating that the results of other similarly affected constables should also be reconsidered."
    },
    {
        "source_file": "Appeal_No._318_of_2018.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Malik Muhammad Aslam vs. The Government of Sindh & Others",
        "Case Number": "Appeal No. 318 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 177/2011, FIR No. 359/2017",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973, Section 5 (1) of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Malik Muhammad Aslam; Respondents: The Government of Sindh, The Inspector General of Police, The Additional Inspector General of Police, The Superintendent of Police",
        "Advocate Names for each party": "Mr. Qaim Ali Memon for respondent; Mr. Asif Hussain Mangi Addl, AG. Sindh State Counsel for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "08.10.2018",
        "Decision/Order Date": "08.10.2018",
        "Outcome of the Application": "Dismissal from service converted to compulsory retirement",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, a police officer, was dismissed from service due to misconduct allegations. The tribunal maintained the dismissal but converted it to compulsory retirement considering the appellant's length of service."
    },
    {
        "source_file": "Appeal_No._324_of_2018.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Malik Muhammad Ashraf vs. Deputy Inspector General and Others",
        "Case Number": "Appeal No. 324 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 59/2017, Date Not mentioned",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973, u/s 220, 26-27 (ATA)",
        "Applicant and Respondents": "Applicant: Malik Muhammad Ashraf; Respondents: 1. Deputy Inspector General, 2. Additional Inspector General, 3. Province of Sindh",
        "Advocate Names for each party": "Appellant: Mr. Nasir Abbas Malik; Respondents: Mr. Asif Hussain Mangi, Mr. Ayaz Rajpar",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "04.09.2018",
        "Decision/Order Date": "15.10.2018",
        "Outcome of the Application": "Appeal allowed; impugned orders set aside; appellant reinstated without back benefits",
        "Cited Case Laws": "Muhammad Safdar Anjum v. Pakistan International Airline Corporation, Basharat Ali v. Director Excise & Taxation Lahore, Federation of Pakistan through Secretary, Establishment Division Islamabad v. Gohar Riaz",
        "Short Summary of the Case": "The appellant challenged his compulsory retirement due to lack of a proper inquiry and violation of his fundamental rights. The tribunal found the orders to be issued in haste and set them aside, reinstating the appellant."
    },
    {
        "source_file": "Appeal_No._32_of_2018.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Iffat Ghazala D/o Mian Muhammad Yousif (Late) vs. Province of Sindh",
        "Case Number": "Appeal No. 299 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Iffat Ghazala; Respondents: Province of Sindh, Secretary School Education Department, Directorate Schools Education, District Education Officer, Ms. Nasreen D/o Allah Jurio",
        "Advocate Names for each party": "Appellant: Mr. Mian Mohsin Raza; Respondents: Ms. Khalida Parveen Shaikh, Mr. Pervaiz Ahmed Memon, Mr. Ghulam Asghar Mirbahar",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Mr. Shoukat Ali Memon, Mr. Iqbal Ahmad Soomro",
        "Hearing Date": "04.10.2018",
        "Decision/Order Date": "04.10.2018",
        "Outcome of the Application": "Appeal is allowed, impugned order set aside",
        "Cited Case Laws": "Anita Turab reported as PLD 2013 (SC) 195",
        "Short Summary of the Case": "The appellant challenged her frequent transfers within the education department, claiming they were politically motivated and violated departmental rules. The tribunal found the transfers unjustified and set aside the order."
    },
    {
        "source_file": "Appeal_No._330_of_2016.pdf",
        "Page count": 9,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Sadaqat Ali and others vs Province of Sindh and others",
        "Case Number": "Appeal No. 330 of 2016",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicants: Sadaqat Ali, Shahuabuddin, Mumtaz Ali, Ali Asghar, Muhammad Anwar, Muhammad Juman; Respondents: Province of Sindh through Secretary, Education Department, District Education Officer (Primary), Dadu, District Accounts Officer, Dadu",
        "Advocate Names for each party": "Mr. S. Kamil Shah, A.A.G. Sindh for respondents; Not mentioned for applicants",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Farooq Azam Memon",
        "Hearing Date": "05.10.2016",
        "Decision/Order Date": "28.10.2016",
        "Outcome of the Application": "Dismissed with direction to hold impartial inquiry through Anti-Corruption",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellants claimed wrongful withholding of their salaries after being appointed as Naib Qasid. The Tribunal found the appointments to be fake and dismissed the appeal, directing an inquiry into corruption."
    },
    {
        "source_file": "Appeal_No._333_of_2018.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Amjad Ali D/o Shaikh Ali Youns vs Government of Sindh & Others",
        "Case Number": "Appeal No. 333 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Amjad Ali; Respondents: Government of Sindh, Inspector General of Police, Additional Inspector General of Police, Deputy Inspector General of Police Establishment",
        "Advocate Names for each party": "Appellant: Mr. Muhammad Shahid; Respondents: Mr. Asif Hussain Mangi, Addl. AG Sindh along with PI Muhammad Nawaz Minhas",
        "Judge Name(s)": "JUSTICE (R) QAISER IQBAL, CHAIRPERSON; MR. SHOUKAT ALI MEMON, MEMBER-I",
        "Hearing Date": "Not mentioned in the document",
        "Decision/Order Date": "Not mentioned in the document",
        "Outcome of the Application": "Appeal stands disposed of; directed to consider the case of the appellant for Intermediate School Course under special circumstances",
        "Cited Case Laws": "Suo Moto Case No. 03/2012, CP No. 492 to 495/2009, Human Rights Case No. 1088 of 2010 and 6679-P of 2011, Service Appeal Nos. 312/2017, 578/2017",
        "Short Summary of the Case": "The appellant was demoted from Sub-Inspector to Constable and seeks consideration for promotion and training based on age and previous service record."
    },
    {
        "source_file": "Appeal_No._345_of_2017.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Mehtab Talat D/o Mukhtiar Ahmed vs. The Secretary (School) Education & Literacy Department, Govt. of Sindh, and others",
        "Case Number": "Appeal No. 345 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Mehtab Talat; Respondents: The Secretary (School) Education & Literacy Department, The Director Schools Education, The Deputy Secretary, The District Education Officer, The District Accounts Officer",
        "Advocate Names for each party": "Mr. Masood A. Noorani for the appellant; Mr. Asif Hussain Mangi, Ms. Khalida Parveen Shaikh, and Mr. Ghulam Hyder Bullo for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "14.09.2017",
        "Decision/Order Date": "14.09.2017",
        "Outcome of the Application": "The appeal is allowed; respondents directed to release salaries to the appellant from 14.09.2017.",
        "Cited Case Laws": "Ghulam Umar Kazi V/s. General Manager & others, 2006 PLC (CS) 1143; Secretary to Government of NWFP Zakat/Social Welfare Department V/s. Sadullah Khan, 1996 SCMR 413; Mst. Basharat Jehan V/s. Director-General, Federal Government Education, FGEI (C/Q) Rawalpindi, 2015 SCMR 1418; Hameed Ahthkar Niazi V/s. The Secretary, Establishment Division Government of Pakistan, 1996 SCMR 1158",
        "Short Summary of the Case": "The appellant, a Physical Education Teacher, challenged the stoppage of her salary by the respondents, claiming entitlement to outstanding arrears and salary. The Tribunal found the stoppage of salary to be illegal and directed the release of salaries."
    },
    {
        "source_file": "Appeal_No._355_of_2016.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Kanwal Naz d/o. Abdul Rehman vs. Government of Sindh and others",
        "Case Number": "355 of 2016",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Kanwal Naz; Respondents: Government of Sindh, Secretary Finance, Director Finance, Additional Director Finance, Additional Director (HR), District Accounts Officer (Hyderabad and Matiari)",
        "Advocate Names for each party": "Appellant: Not mentioned; Respondents: Mr. S. Kamil Shah AAG Sindh, Mr. Zakir Ali Shah, Mr. Allah Bachayo Jatoi, Mr. Roshan Ali Rajpar",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Farooq Azam Memon",
        "Hearing Date": "18.10.2016",
        "Decision/Order Date": "08.11.2016",
        "Outcome of the Application": "The appeal stands allowed in above terms with no order as to costs.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant contested her non-payment of salary after being appointed as Laboratory Assistant. The Tribunal found her appointment genuine and entitled her to salary from the date of joining, excluding the four months already paid."
    },
    {
        "source_file": "Appeal_No._373_of_2019.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Burhanuddin vs. The Deputy Inspector General of Police and Senior Superintendent of Police",
        "Case Number": "373 of 2019",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 13/2002, dated 26.01.2002",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Burhanuddin; Respondents: The Deputy Inspector General of Police, Senior Superintendent of Police",
        "Advocate Names for each party": "Mr. Maula Buksh Khoso for the appellant; Mr. Imran Ali Jatoi, Asst. AG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Sadiq Hussain Bhatti, Tariq Mehmood Khoso",
        "Hearing Date": "07.02.2023",
        "Decision/Order Date": "03.03.2023",
        "Outcome of the Application": "Appeal allowed; impugned orders set aside; reinstatement with back benefits",
        "Cited Case Laws": "Honourable Supreme Court of Pakistan, dated 22.09.2015",
        "Short Summary of the Case": "The appellant was compulsorily retired based on allegations of a patchy service record and previous criminal involvement. The tribunal found that the subsequent punishment constituted double jeopardy and reinstated the appellant."
    },
    {
        "source_file": "Appeal_No._399_of_2000_&_18_of_2012.pdf",
        "Page count": 15,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Ghulam Sarwar Thaheem vs. Governor of Sindh/Controlling Authority and others; Naseer Ahmed Leghari vs. Chairman, Board of Intermediate and Secondary Education, Sukkur and others",
        "Case Number": "S.A. No. 399 of 2000 and S.A. No. 18 of 2012",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Ghulam Sarwar Thaheem; Respondents: Governor of Sindh/Controlling Authority, Chief Minister Sindh; Applicant: Naseer Ahmed Leghari; Respondents: Chairman, Board of Intermediate and Secondary Education, Sukkur, Secretary, Board of Intermediate and Secondary Education, Sukkur",
        "Advocate Names for each party": "Mr. Mansoor-ul-Haq Solangi for Ghulam Sarwar Thaheem; Mr. Ghulam Sarwar Chandio for Naseer Ahmed Leghari; Ms. Shahida Jatoi for respondents",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Ameer Faisal, Member-I",
        "Hearing Date": "12.09.2013 and 03.10.2013",
        "Decision/Order Date": "07.10.2013",
        "Outcome of the Application": "Both appeals disposed of; Tribunal held it has no jurisdiction",
        "Cited Case Laws": "Muhammad Mubeen-us-Salam v. Federation of Pakistan, PLD-2006-SC-602; Muhammad Idrees v. Agricultural Development Bank of Pakistan, PLD-2007-SC-681; Deedar Ahmed Bhayo v. National Bank of Pakistan, 2013-SCMR-894",
        "Short Summary of the Case": "The appeals involved questions of jurisdiction of the Tribunal regarding employees of the Board of Intermediate and Secondary Education, determining that they are not civil servants and thus the Tribunal has no jurisdiction over their cases."
    },
    {
        "source_file": "Appeal_No._428_of_2017.pdf",
        "Page count": 9,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Amanullah Memon vs. The Province of Sindh and others",
        "Case Number": "Appeal No. 428 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section-4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Amanullah Memon; Respondents: The Province of Sindh, The Secretary Works and Services Department, Section Officer (E-I), Arshad Hussain Bhutto",
        "Advocate Names for each party": "Mr. Abdul Salam Memon for the appellant; Mr. Asif Hussain Mangi, Addl: AG Sindh for respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "01.11.2017",
        "Decision/Order Date": "20.11.2017",
        "Outcome of the Application": "Appeal is allowed; impugned notification set aside",
        "Cited Case Laws": "Ms. Anita Turab in Constitutional Petition No.23/2012, PLD 2013 SC 195; Lahore High Court judgment reported in 1997 PLC (C.S) 754",
        "Short Summary of the Case": "The appellant challenged a transfer notification, arguing it was issued without proper procedure and in violation of established laws and principles of good governance. The tribunal found the notification to be invalid and set it aside."
    },
    {
        "source_file": "Appeal_No._43_of_2013.pdf",
        "Page count": 25,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "SI Muhammad Yaseen vs. ASI Sain Bux Chandio & Others",
        "Case Number": "Appeal No.43 of 2013",
        "Type of Petition or Application": "Appeal under Section 4 of the Sindh Service Tribunal Act, 1973",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunal Act, 1973",
        "Applicant and Respondents": "Applicant: SI Muhammad Yaseen; Respondents: ASI Sain Bux Chandio, SI Sher Muhammad Sangi, Deputy Inspector General of Police, Assistant Inspector General of Police, Inspector General of Police, Home Secretary Govt of Sindh",
        "Advocate Names for each party": "Mr. Abdul Khalique for the appellant; Ms. Shahida Jatoi for respondents",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal",
        "Hearing Date": "22.10.2013",
        "Decision/Order Date": "06.11.2013",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, SI Muhammad Yaseen, challenged the withdrawal of his ante-dated appointment and seniority by the police department, claiming he was unlawfully deprived of his rightful position as ASI. The tribunal found the withdrawal of his seniority and promotion to be legally justified."
    },
    {
        "source_file": "Appeal_No._445_of_2017.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Juman Arbab vs The Chief Minister Sindh and The Chief Secretary Sindh",
        "Case Number": "Appeal No. 445 of 2017",
        "Type of Petition or Application": "Appeal for ante-dated promotion",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Muhammad Juman Arbab; Respondents: The Chief Minister Sindh, The Chief Secretary Sindh",
        "Advocate Names for each party": "Mr. Asif Hussain Mangi for official respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "09.10.2017",
        "Decision/Order Date": "02.11.2017",
        "Outcome of the Application": "Entitled to proforma promotion after retirement with effect from 22nd November, 2005",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Muhammad Juman Arbab, sought ante-dated promotion in BS-20 from 22nd November 2005, claiming deprivation of promotion rights due to seniority disputes and procedural issues within the Planning & Development Department."
    },
    {
        "source_file": "Appeal_No._459_of_2018.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Sher Muhammad S/o Atta Muhammad vs The Inspector General of Police Sindh and others",
        "Case Number": "459 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 17/2017, dated 25.04.2017",
        "Legal Sections Involved": "u/s 324/401/399 PPC",
        "Applicant and Respondents": "Applicant: Sher Muhammad; Respondents: 1. The Inspector General of Police Sindh, 2. The Deputy Inspector General of Police, Sindh, 3. The Senior Superintendent of Police District Jacobabad",
        "Advocate Names for each party": "Mr. Akhtiar Hussain Soomro for the appellant; Mr. Asif Hussain Mangi Addl. A.G Sindh for respondents",
        "Judge Name(s)": "JUSTICE (R) QAISER IQBAL, CHAIRPERSON; IQBAL AHMAD SOOMRO, MEMBER-II",
        "Hearing Date": "29.11.2018",
        "Decision/Order Date": "19.12.2018",
        "Outcome of the Application": "Dismissal from Service modified to Compulsory Retirement from Service",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Sher Muhammad, was dismissed from service for falsely implicating individuals in a case. After appeal, the dismissal was modified to compulsory retirement considering his 22 years of service."
    },
    {
        "source_file": "Appeal_No._46_of_2012.pdf",
        "Page count": 16,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Abdul Haque Khushk vs The Government of Sindh and others",
        "Case Number": "Appeal No. 46 of 2012",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "FIR No: 91 / 2005 PS Mohbat Dero Jatoi",
        "Legal Sections Involved": "Section 4 of Service Tribunals Act 1973, Sindh Civil Servants (Appeal) Rules, 1980",
        "Applicant and Respondents": "Applicant: Abdul Haque Khushk; Respondents: The Government of Sindh, The Secretary Education Department, The Managing Director STEVTA, The Director (Admn) STEVTA, and various Assistant Professors",
        "Advocate Names for each party": "Mr. M.A. Hakeem for the appellant; Ms. Shahida Jatoi for A.G Sindh; Mr. Haq Nawaz Talpur for respondents 3 & 4",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Mr. Ameer Faisal",
        "Hearing Date": "16.08.2013",
        "Decision/Order Date": "28.08.2013",
        "Outcome of the Application": "Appeal dismissed as pre-mature",
        "Cited Case Laws": "Teekam Dass case reported in 2002-SCMR-142 and 1999-SCMR-2786",
        "Short Summary of the Case": "The appellant contested the final seniority list issued by the respondents, claiming procedural flaws and lack of proper communication regarding his departmental appeal. The tribunal found the appeal to be pre-mature as it was filed without waiting for the required period after the departmental appeal."
    },
    {
        "source_file": "Appeal_No._486_of_2018.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Aman Shah S/o Shah Zaman vs Province of Sindh & Others",
        "Case Number": "Appeal No.486 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Aman Shah; Respondents: Province of Sindh, Inspector General of Police, Deputy Inspector General of Police (D.I.G.P)",
        "Advocate Names for each party": "Mr. Fasih-us-Zaman Abbasi for appellant; Mr. Asif Hussain Mangi, Addl: AG Sindh along with ASI Muhammad Imran for respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Iqbal Ahmad Soomro",
        "Hearing Date": "28.11.2018",
        "Decision/Order Date": "21.12.2018",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "C.P. No.89/2011, CRP No. 197/2013",
        "Short Summary of the Case": "The appellant, Aman Shah, challenged the withdrawal of his promotion from constable to cook, arguing that it was uncalled for and violated his rights. The tribunal found the appeal time-barred and dismissed it."
    },
    {
        "source_file": "Appeal_No._494_of_2016.pdf",
        "Page count": 11,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Syed Nazar Hussain Shah vs The Deputy Inspector General of Police & Another",
        "Case Number": "Appeal No. 494 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 672/2015 dated 14-10-2015",
        "Legal Sections Involved": "Section 364-A, 34 PPC, Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Syed Nazar Hussain Shah; Respondents: 1. The Deputy Inspector General of Police, 2. Senior Superintendent of Police (Investigation-II)",
        "Advocate Names for each party": "Mr. Maula Buksh Khoso for the appellant; Mr. S. Kamil Shah AAG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Farooq Azam Memon, Member-II",
        "Hearing Date": "06.06.2016",
        "Decision/Order Date": "06.06.2016",
        "Outcome of the Application": "The impugned orders were set aside, and the appellant was directed to be reinstated in service.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant challenged the dismissal from service imposed without proper inquiry and final show cause notice, arguing that the authority imposing the penalty was not competent. The tribunal found the dismissal without jurisdiction and remanded the case for fresh proceedings."
    },
    {
        "source_file": "Appeal_No._511_of_2018.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Ashfaque Hussain Baloch vs The Addl;Inspector General of Police, Karachi Range and The Deputy Inspector General of Police, West Zone",
        "Case Number": "511 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 104/2013 dated 13.03.2013",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973; u/s 5 (1) of Sindh Service Tribunals Act, 1973; Sindh Police (Efficiency & Discipline) Rules, 1988",
        "Applicant and Respondents": "Applicant: Ashfaque Hussain Baloch; Respondents: The Addl;Inspector General of Police, Karachi Range; The Deputy Inspector General of Police, West Zone",
        "Advocate Names for each party": "Mr. Maula Buksh Khoso for the appellant; Mr. Asif Hussain Mangi Addl. AG Sindh along with Mr. Ayaz Rajpar for respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "18.10.2018",
        "Decision/Order Date": "18.10.2018",
        "Outcome of the Application": "Dismissal order set-aside; penalty converted to compulsory retirement",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Ashfaque Hussain Baloch, was dismissed from service due to allegations of misconduct related to a high-profile murder case. The tribunal modified the dismissal to compulsory retirement based on the appellant's long service and willingness to retire prematurely."
    },
    {
        "source_file": "Appeal_No._512_of_2018.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Aamir S/o Muhammad Hanif vs. Provincial of Sindh and others",
        "Case Number": "Appeal No. 512 of 2018",
        "Type of Petition or Application": "Appeal under Sindh Service Tribunal Act, 1973",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Muhammad Aamir; Respondents: Provincial of Sindh, Inspector General of Police, Additional Inspector General of Police, Senior Superintendent of Police, Inspector Bomb Disposal Unit",
        "Advocate Names for each party": "Appellant: Mr. Choudhry Abdul Rasheed; Respondents: Ms. Khalida Parveen Shaikh, Mr. Muhammad Imran ASI",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "06.11.2018",
        "Decision/Order Date": "04.12.2018",
        "Outcome of the Application": "Appeal stands allowed",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant's promotion to Inspector was deferred due to average ACRs for 2015 and 2016. The Tribunal directed the competent authority to reconsider the appellant's case for promotion based on upgraded ACRs."
    },
    {
        "source_file": "Appeal_No._513_of_2022.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Mst. Ghazala Birjees vs Government of Sindh",
        "Case Number": "Appeal No. 513 of 2022",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Mst. Ghazala Birjees; Respondents: Government of Sindh, Director, District Education Officer, Taluka Education Officer",
        "Advocate Names for each party": "Appellant: Mr. Muhammad Ibrahim M. Sahito; Respondents: Mr. Imran Ali Jatoi, Mr. Javed Ali Khawja, Mr. Abdul Fatah",
        "Judge Name(s)": "Justice (R) Sadiq Hussain Bhatti, Tariq Mehmood Khoso, Dr. Khalil-ur-Rehman Shaikh",
        "Hearing Date": "08.08.2023",
        "Decision/Order Date": "04.09.2023",
        "Outcome of the Application": "Appeal allowed, original order set aside, appellant reinstated",
        "Cited Case Laws": "SECRETARY, KASHMIR AFFAIRS AND NORTHERN AREAS DIVISION, ISLAMABAD V. SAEED AKHTAR, PLD 2008 SC 392",
        "Short Summary of the Case": "The appellant was removed from service due to alleged continuous absence and harassment by a PST. The tribunal found the removal to be illegal and reinstated the appellant, ordering a regular enquiry into the allegations."
    },
    {
        "source_file": "Appeal_No._525_of_2015.pdf",
        "Page count": 15,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Mubeen Ahmed and Others vs Government of Sindh and Others",
        "Case Number": "S.A. No. 525 of 2015",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicants: Mubeen Ahmed, Abdul Ghaffar, Mustaq Ahmed, Muhammad Ali, Attique ur Reham, Syed Kashif Ali; Respondents: Government of Sindh, Secretary Finance Department, Secretary Education & Literacy Department, Accountant General Sindh, District Accounts Officer Larkana, District Accounts Officer Shikarpur",
        "Advocate Names for each party": "Mr. Safdar Hussain for the appellants; Mr. S. Kamil Shah, AAG Sindh along with Mr. Zakir Hussain Shah for respondents",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Farooq Azam Memon",
        "Hearing Date": "07.05.2015",
        "Decision/Order Date": "24.06.2015",
        "Outcome of the Application": "Appeal allowed; respondents directed to pay computer allowance and refund deducted amounts",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellants, lecturers in computer science, challenged the stoppage of their computer allowance, claiming eligibility based on their qualifications and full-time employment. The tribunal ruled in favor of the appellants, reinstating their entitlement to the allowance."
    },
    {
        "source_file": "Appeal_No._526_of_2017.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Jehanzaib S/o Muhammad Nawaz vs. The Province of Sindh and others",
        "Case Number": "Appeal No. 526 of 2017",
        "Type of Petition or Application": "Appeal under section 4 of the Sindh Service Tribunals Act, 1973",
        "FIR Number and Date": "FIR No: 25/2012 U/S 302/365/34 PPC of Memon Goth PS",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973; Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Jehanzaib S/o Muhammad Nawaz; Respondents: 1. The Province of Sindh, 2. Deputy Inspector General of Police, 3. Senior Superintendent of Police, District Malir",
        "Advocate Names for each party": "Appellant: Mr. Malik Altaf Javed; Respondents: Mr. Asif Hussain Mangi, Ms. Khalida Parveen Shaikh",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "08.05.2018",
        "Decision/Order Date": "08.05.2018",
        "Outcome of the Application": "Appeal stands allowed; appellant reinstated in service",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant was reinstated in service after the tribunal found that the major penalty of compulsory retirement imposed without a proper inquiry was not sustainable in law."
    },
    {
        "source_file": "Appeal_No._536_of_2017.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Abdul Rasheed Keerio vs The Province of Sindh",
        "Case Number": "Appeal No. 536 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Abdul Rasheed Keerio; Respondents: The Province of Sindh, Secretary Schools, Director Schools Education, District Education Officer, Assistant District Officer (Male), Assistant District Officer (Female)",
        "Advocate Names for each party": "Mr. Muhammad Arshad Khan Tanoli for the appellant; Mr. Asif Hussain Mangi, Addl. AG Sindh along with Pervaiz Ahmed Memon for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Chairperson; Mr. Shoukat Ali Memon, Member-I; Mr. Iobal Ahmad Soomro, Member-II",
        "Hearing Date": "21.12.2017",
        "Decision/Order Date": "21.12.2017",
        "Outcome of the Application": "Appeal allowed; appellant to continue as Naib Qasid in BPS-02 until superannuation",
        "Cited Case Laws": "Government of Sindh V/s. Masood Hussain, 2002 SCMR 115; Pakistan International Airlines Corporation through Chairman & others V/s. Shahzad Farooque Malik & others, 2004 SCMR 158",
        "Short Summary of the Case": "The appellant, Abdul Rasheed Keerio, challenged the termination of his services as a Primary School Teacher, claiming political victimization and discriminatory treatment. The tribunal allowed the appeal, reinstating him as Naib Qasid until retirement."
    },
    {
        "source_file": "Appeal_No._55_of_2015.pdf",
        "Page count": 39,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Abdul Aleem Bullo vs The Province of Sindh & Others",
        "Case Number": "Appeal No.55 of 2015",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Civil Servants Act, 1973; Sindh Civil Servants (Appointment, Promotion and Transfer) Rules, 1974; Articles 10-A and 25 read with Article 4 of the Constitution of Pakistan",
        "Applicant and Respondents": "Abdul Aleem Bullo (Applicant); The Province of Sindh, Inspector General Police Sindh, Home Department (Respondents)",
        "Advocate Names for each party": "Mr. Haseeb Jamali for the appellant; Jabbar Qureshi, AAG Sindh along with P.I. Mussadiq Amjad for respondents",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Ameer Faisal, Member-I",
        "Hearing Date": "25.02.2015",
        "Decision/Order Date": "05.03.2015",
        "Outcome of the Application": "The appeal is dismissed; the appointment of the appellant was found illegal and rightly withdrawn.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Abdul Aleem Bullo, challenged the withdrawal of his appointment as Deputy Superintendent of Police under the Shaheed Quota, claiming it was discriminatory and illegal. The tribunal found that the appointment was made in violation of the law and upheld the withdrawal."
    },
    {
        "source_file": "Appeal_No._574_of_2017.pdf",
        "Page count": 10,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Dr. Karim Bux Laghari vs. Chief Secretary Sindh & Others",
        "Case Number": "Appeal No. 574 of 2017",
        "Type of Petition or Application": "Appeal under section 4 of the Sindh Service Tribunals Act, 1973",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Dr. Karim Bux Laghari; Respondents: 1. Chief Secretary Sindh, 2. Secretary (Services) SGA & C department, 3. Secretary to Govt. of Sindh, 4. Noor Muhammad Baluch",
        "Advocate Names for each party": "For Appellant: Mr. Muhammad Arshad Khan Tanoli; For Respondents No. 1 & 3: Mr. Asif Hussain Mangi, Mr. Abdul Samad Shaikh; For Respondent No. 4: Mr. Malik Naeem Iqbal",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "11.10.2017",
        "Decision/Order Date": "16.11.2017",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "PLD 2013 Lahore 413, Liaquat Ali Chugtai V/s. Federation of Pakistan, PLD 1999 SC 504, PLD 2008 SC 769, 2015 SCMR 1006, 2003 PLC (CS) 569",
        "Short Summary of the Case": "The appellant challenged the promotion of respondent No. 4 to Director General (BPS-20) on grounds of favoritism and lack of eligibility, asserting that the promotion process violated established legal criteria. The tribunal found it lacked jurisdiction to assess fitness for promotion and dismissed the appeal."
    },
    {
        "source_file": "Appeal_No._589_of_2023.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Abdul Ghaffar Bhutto vs Chief Secretary Government of Sindh",
        "Case Number": "Appeal No. 589 of 2023",
        "Type of Petition or Application": "Not mentioned in the document",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973; Section 10 of the Sindh Civil Servants Act, 1973",
        "Applicant and Respondents": "Applicant: Abdul Ghaffar Bhutto; Respondents: Chief Secretary Government of Sindh, Secretary College Education Department, Mr. Muhammad Qasim Rajpar",
        "Advocate Names for each party": "Mr. Samiullah Pathan for the appellant; Mr. Asif Hussain Mangi and Mr. Ahsanullah Leghari for the official respondents; Mr. Jamil Ahmed Rajpar for private respondent No.03",
        "Judge Name(s)": "Tariq Mehmood Khoso, Dr. Khalil-ur-Rehman Shaikh",
        "Hearing Date": "09.08.2023",
        "Decision/Order Date": "23.08.2023",
        "Outcome of the Application": "The instant appeal merits no consideration and is hereby dismissed",
        "Cited Case Laws": "FIDA HUSSAIN SHAH and others V. GOVERNMENT OF SINDH and others, reported as 2017 PLC (C.S.) 1229",
        "Short Summary of the Case": "The appellant challenged his transfer from the post of Director Finance to which he was appointed, alleging that the transfer was made to a junior officer involved in corruption. The tribunal found the transfer to be within the authority of the government and dismissed the appeal."
    },
    {
        "source_file": "Appeal_No._599_of_2021.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal Karachi",
        "Case Title": "Majid Ali vs Province of Sindh and others",
        "Case Number": "Appeal No. 599 of 2021",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Majid Ali; Respondents: Province of Sindh, Inspector General of Police, Deputy Inspector General of Police",
        "Advocate Names for each party": "Appellant: Mr. Malik Naeem Iqbal; Respondents: Mr. Imran Ali Jatoi, Mr. Juma Din",
        "Judge Name(s)": "Mr. Justice (R) Sadiq Hussain Bhatti, Mr. Tariq Mehmood Khoso, Dr. Khalil-ur-Rehman Shaikh",
        "Hearing Date": "14.09.2023",
        "Decision/Order Date": "28.09.2023",
        "Outcome of the Application": "Dismissed",
        "Cited Case Laws": "2000 SCMR 75, 2009 SCMR 1121, 2011 SCMR 1717, 2012 SCMR 195",
        "Short Summary of the Case": "The appellant, Majid Ali, challenged his discharge from service due to absence without permission, citing medical issues. The tribunal found the appeal time-barred and dismissed it without discussing merits."
    },
    {
        "source_file": "Appeal_No._628_of_2017.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Anees Khan vs. Additional Inspector General of Police, Karachi Range, Karachi",
        "Case Number": "628 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Muhammad Anees Khan; Respondents: 1. Additional Inspector General of Police, Karachi Range, Karachi; 2. Deputy Inspector General of Police, West Zone, Karachi",
        "Advocate Names for each party": "Mr. Ghulam Sarwar Chandio for the appellant; Mr. Asif Hussain Mangi for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "10.11.2017",
        "Decision/Order Date": "10.11.2017",
        "Outcome of the Application": "Appeal allowed; impugned orders set aside",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, a police constable, was dismissed from service on allegations of misconduct. After reinstatement, he faced further disciplinary action resulting in forfeiture of service. The tribunal found procedural flaws in the disciplinary process and set aside the penalties."
    },
    {
        "source_file": "Appeal_No._633_of_2016.pdf",
        "Page count": 12,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Shoaib Ur Rehman vs The Province of Sindh",
        "Case Number": "Appeal No. 6330F 2016",
        "Type of Petition or Application": "Appeal against dismissal from service",
        "FIR Number and Date": "FIR No. 93/2015 and FIR No. 94/2015, dates not mentioned",
        "Legal Sections Involved": "Section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Shoaib Ur Rehman; Respondents: The Province of Sindh, Inspector General of Police, Deputy Inspector General of Police, Superintendent of Police",
        "Advocate Names for each party": "Mr. Ghulam Rasool Mangi for the appellant; Mr. S. Kamil Shah, AAG Sindh for respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Farooq Azam Memon",
        "Hearing Date": "07.10.2016",
        "Decision/Order Date": "24.10.2016",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Criminal Petition No. 89-K of 2014, Government of Pakistan vs. Asif Ali and others, Muhammad Abdullah vs. The Inspector General of Police and others, Habib Bank Ltd. vs. Shahid Masud Malik",
        "Short Summary of the Case": "The appellant was dismissed from service due to involvement in criminal cases and a patchy service record, despite being acquitted in the criminal trials."
    },
    {
        "source_file": "Appeal_No._637_of_2016.pdf",
        "Page count": 17,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Adeel Ahmed Qureshi vs. Inspector General, Sindh Police & The Additional Inspector General Police Sindh Karachi",
        "Case Number": "Appeal No. 637 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Adeel Ahmed Qureshi (Appellant) vs. Inspector General, Sindh Police & The Additional Inspector General Police Sindh Karachi (Respondents)",
        "Advocate Names for each party": "Mr. Ghulam Sarwar Chandio and Mr. Sarfaraz Ali Lashari for the appellant; Mr. S. Kamil Shah, AAG Sindh for respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Farooq Azam Memon",
        "Hearing Date": "24.08.2016",
        "Decision/Order Date": "24.08.2016",
        "Outcome of the Application": "The appeal is allowed. The appellant is reinstated in service.",
        "Cited Case Laws": "CP No. 4569/2012",
        "Short Summary of the Case": "The appellant, Adeel Ahmed Qureshi, was removed from service on allegations of cheating during recruitment. The tribunal found the removal to be illegal as the appellant was not afforded a proper opportunity to defend himself and reinstated him with benefits from the date of joining."
    },
    {
        "source_file": "Appeal_No._650_of_2016.pdf",
        "Page count": 21,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Junaid Sikandar vs Government of Sindh",
        "Case Number": "Appeal No. 650 of 2016",
        "Type of Petition or Application": "Not mentioned in the document",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Junaid Sikandar; Respondents: Government of Sindh, Chairman Enquiries & Anti Corruption (Sindh), Director Anti Corruption Establishment Sindh, The Accountant General (Sindh), and others",
        "Advocate Names for each party": "Mr. S. Kamil Shah, AAG Sindh; Mr. M.M. Aqil Awan, advocate for private respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Farooq Azam Memon",
        "Hearing Date": "25.10.2016",
        "Decision/Order Date": "30.11.2016",
        "Outcome of the Application": "The entire process of selection and appointment of Sub Inspectors in Anti-Corruption Establishment is violative of the law and is not above board.",
        "Cited Case Laws": "1991 SCMR 1192, 2009 PLC CS 79, 1979 SCMR 469, PLD 1979 S.C 856, 2001 SCMR 848, 1995 SCMR 1675, 1997 SCMR 1581, 2006 SCMR 1317, PLD 2005 Supreme Court 270, 1991 SCMR 1041, 2007 PLC (CS) 31, PLD 1997 Supreme Court 382",
        "Short Summary of the Case": "The appellant challenged the appointment of private respondents as Sub Inspectors in the Anti-Corruption Establishment Sindh, alleging violation of merit and prescribed procedure."
    },
    {
        "source_file": "Appeal_No._679_of_2017.pdf",
        "Page count": 11,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Zareen Asrar vs. Inspector General of Police, Sindh",
        "Case Number": "APPEAL NO. 679 OF 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Zareen Asrar; Respondents: 1. Inspector General of Police, Sindh; 2. Additional Inspector General of Police; 3. Deputy Inspector General of Police, South Zone",
        "Advocate Names for each party": "Appellant: Mr. Muhammad Arshad Khan Tanoli; Respondents: Mr. Asif Hussain Mangi, Addl: AG Sindh",
        "Judge Name(s)": "JUSTICE (R) QAISER IQBAL, CHAIRPERSON; MR. IQBAL AHMAD SOOMRO, MEMBER-II",
        "Hearing Date": "11.12.2017",
        "Decision/Order Date": "19.01.2018",
        "Outcome of the Application": "The appeal is allowed in above terms.",
        "Cited Case Laws": "Muhammad Zikriya & others V/s. Senior Superintendent of Police, Multan & others, 2003 PLC (CS) 906; Bashir Ahmed Solangi V/s. Chief Secretary, Govt. of Sindh & 2 others, 2007 PLC (CS) 824; Chairman Minimum Wage Board, Peshawar V/s. Fayyaz Khan Khattak, 1999 SCMR 1004",
        "Short Summary of the Case": "The appellant, Zareen Asrar, challenged the nullification of her B-1 examination result due to age restrictions, arguing that she was discriminated against despite being qualified and having served for eight years. The Tribunal allowed her appeal, stating that her case should be reconsidered for age relaxation and promotion."
    },
    {
        "source_file": "Appeal_No._67_of_2015.pdf",
        "Page count": 11,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Jawaid Ali vs. Province of Sindh",
        "Case Number": "Appeal No. 67 of 2015",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Jawaid Ali, Muhammad Ibrahim, Liaquat Ali; Respondents: Province of Sindh, Additional Chief Secretary, Registrar Cooperative Societies",
        "Advocate Names for each party": "Mr. Malik Altaf Javed for the appellant; Mr. S. Kamil Shah, A.A.G. Sindh for respondents",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal, Farooq Azam Memon",
        "Hearing Date": "19.05.2015",
        "Decision/Order Date": "29.05.2015",
        "Outcome of the Application": "Appeal allowed; cancellation of appointment set aside",
        "Cited Case Laws": "Muhammad Akhtar Shirani and others v/s Punjab Text book Board and others 2004 SCMR 1077",
        "Short Summary of the Case": "The appellants were appointed in the Cooperation Department of Sindh, but their appointments were cancelled on the grounds of being made during a ban period. The tribunal found the cancellation unjustified and reinstated the appellants with back benefits."
    },
    {
        "source_file": "Appeal_No._72_of_2012.pdf",
        "Page count": 15,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Zulfiqar Ali Memon vs. Government of Sindh",
        "Case Number": "Appeal No. 72/2012",
        "Type of Petition or Application": "Appeal under section 4 of the Sindh Service Tribunals Act, 1973",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Zulfiqar Ali Memon (Appellant) vs. Government of Sindh, Chief Minister Sindh, Chief Secretary, Secretary to Government of Sindh (Respondents)",
        "Advocate Names for each party": "Mr. Ansari Abdul Lateef (Advocate for the appellant), Ms. Shahida Jatoi (State Counsel for A.G. Sindh), Mr. Safdar Hussain Soomro (Section Officer for respondents)",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Mr. Ameer Faisal",
        "Hearing Date": "Not mentioned in the document",
        "Decision/Order Date": "Not mentioned in the document",
        "Outcome of the Application": "Allowed in terms that the appellant shall be promoted with effect from 20.12.2011",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant challenged the notification of his promotion, arguing that he should have been promoted retrospectively from 18.12.2010 instead of 21.01.2012. The Tribunal ruled in favor of the appellant, stating he should be promoted from 20.12.2011, aligning his seniority correctly."
    },
    {
        "source_file": "Appeal_No._72_of_2014.pdf",
        "Page count": 12,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Noor Muhammad Abro vs The Province of Sindh and others",
        "Case Number": "S.A No. 72 of 2014",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Civil Servants Act, 1973; Sindh Civil Servants (Appointment, Promotion & Transfer) Rules, 1974; Sindh Civil Servants (Probation, Confirmation & Seniority) Rules, 1975",
        "Applicant and Respondents": "Applicant: Noor Muhammad Abro; Respondents: The Province of Sindh, Inspector General of Police, Deputy Inspector General Police, Superintendent of Police, and others",
        "Advocate Names for each party": "Appellant: Mr. M.A. Hakeem; Respondents: Mr. S. Kamil Shah, AAG alongwith Dr. Mazhar Ali Shah, AIGP (Legal)",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Faroog Azam Memon, Member-II",
        "Hearing Date": "06.08.2014",
        "Decision/Order Date": "21.08.2014",
        "Outcome of the Application": "Appeal allowed; appointment order modified to specify appointment as ASI w.e.f. 24.12.1995",
        "Cited Case Laws": "Mazhar Hussain v. Province of Punjab, Muhammad Farooq Memon v. Government of Sindh, Abdul Malik v. Province of Sindh, Shahzad Gul and others v. Government of N.W.F.P",
        "Short Summary of the Case": "Noor Muhammad Abro appealed for recognition of his appointment date as 24.12.1995 instead of 29.02.2000, claiming he was unjustly denied promotion and seniority over other ASIs appointed without proper selection. The tribunal ruled in his favor, granting him seniority from the earlier date."
    },
    {
        "source_file": "Appeal_No._763_of_2017.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Imtaiz Ahmed Khan Ex-Inspector vs. Inspector General Police Sindh & Additional Inspector General Police Karachi Range",
        "Case Number": "Appeal No. 763 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973; Section 5(1) of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Imtaiz Ahmed Khan; Respondents: Inspector General Police Sindh, Additional Inspector General Police Karachi Range",
        "Advocate Names for each party": "Appellant: M/s Malik Naeem Iqbal and Muhammad Nasir; Respondents: Mr. Asif Hussain Mangi, Mr. Ayaz Rajpar, ASI Imran, Inspector Zafar Javed",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "12.01.2018",
        "Decision/Order Date": "12.01.2018",
        "Outcome of the Application": "Appeal allowed; impugned orders set aside; appellant reinstated in service",
        "Cited Case Laws": "1993 SCMR 1440, 2007 SCMR 1726, 2012 PLC (C.S) 189, 2010 PLC (C.S) 1299",
        "Short Summary of the Case": "The appellant was removed from service based on allegations of misconduct related to criminal activities. The tribunal found that the removal was not in accordance with the law, as proper inquiry procedures were not followed, and reinstated the appellant with directions for a regular inquiry."
    },
    {
        "source_file": "Appeal_No._767_of_2017.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Abdul Shakoor Lakho vs Government of Sindh",
        "Case Number": "Appeal No. 767 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 41/2015 dated 16.04.2015",
        "Legal Sections Involved": "Sindh Service Tribunals Act, 1973; Removal from Service (Special Powers) Sindh Ordinance 2000",
        "Applicant and Respondents": "Applicant: Abdul Shakoor Lakho; Respondents: Government of Sindh, Inspector General of Police Sindh, Deputy Inspector General of Police Sukkur Range, SSP District Ghotki",
        "Advocate Names for each party": "Mr. Imitaz Mansoor Solangi for the appellant; Mr. Asif Hussain Mangi, Addl: AG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "04.09.2018",
        "Decision/Order Date": "05.10.2018",
        "Outcome of the Application": "Appeal allowed, impugned order set aside, appellant reverted back to the post of ASI",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Abdul Shakoor Lakho, challenged the major punishment of reduction in rank from Assistant Sub-Inspector to Head Constable. The tribunal found that the allegations against him were not substantiated and allowed the appeal, reverting him to his previous rank."
    },
    {
        "source_file": "Appeal_No._809_of_2019_(125_Others).pdf",
        "Page count": 55,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Not mentioned in the document",
        "Case Number": "Multiple (e.g., Appeal No. 809 of 2019, Appeal No. 810 of 2019, etc.)",
        "Type of Petition or Application": "Service Appeals",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Multiple applicants (e.g., Shoukatuallah, Muhammad Yousif Bozdar) vs. Province of Sindh, Inspector General of Police, etc.",
        "Advocate Names for each party": "Mr. Ahmed Ali Ghumro, Mr. Raja Basantani, Mr. Ghulam Sarwar Chandio, Mr. Muhammad Nasir, Syed Fida Hussain Shah, Mr. Muhammad Haroon Shaikh, Mr. Sanaullah Thebo, Mr. Nadir Hussain Tunio, Mr. Mansoor-ul-Haque Solangi, Mr. Ali Asadullah Bullo, Mr. Piyar Ali Soomro, Mr. Asif Hussain Mangi",
        "Judge Name(s)": "Justice (R) Sadiq Hussain Bhatti, Tariq Mehmood Khoso, Dr. Khalil-ur-Rehman Shaikh",
        "Hearing Date": "27.11.2023",
        "Decision/Order Date": "30.11.2023",
        "Outcome of the Application": "All the captioned appeals are hereby dismissed.",
        "Cited Case Laws": "Various cases mentioned including but not limited to 2013 SCMR 1752, 2015 SCMR 456, 2018 SCMR 1218, etc.",
        "Short Summary of the Case": "The appeals involve the withdrawal of ante-dated appointments/seniority, out of turn promotions, and accelerated promotions of police personnel, with the tribunal ruling that such promotions were not lawful."
    },
    {
        "source_file": "Appeal_No._817_of_2015.pdf",
        "Page count": 22,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Raj Kumar Son of Mool Chand vs The Chief Secretary Government of Sindh & Others",
        "Case Number": "Appeal No. 817 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Raj Kumar (Appellant) vs 1. The Chief Secretary Government of Sindh, 2. The Secretary, Irrigation Government of Sindh, 3. The Secretary (Services) Service & General Administration Deptt.",
        "Advocate Names for each party": "Mr. Rajendar Kumar Chhabria (for appellant), Mr. Wasique Ahmed Kehar (for certain respondents), Mr. S. Kamil Shah, AAG Sindh (for official respondents)",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Mr. Ameer Faisal, Mr. Farooq Azam Memon",
        "Hearing Date": "20.10.2015",
        "Decision/Order Date": "16.11.2015",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant challenged the final seniority list and sought re-arrangement of seniority and promotion, claiming that direct appointments violated the prescribed ratio for promotions."
    },
    {
        "source_file": "Appeal_No._834_of_2019.pdf",
        "Page count": 14,
        "Court Name": "Sindh Service Tribunal Karachi",
        "Case Title": "Qamar Shahid Siddiqui vs Chief Minister Sindh & Others",
        "Case Number": "Appeal No.834 of 2019",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Qamar Shahid Siddiqui; Respondents: Chief Minister Sindh, Chief Secretary Sindh, Secretary School Education Literacy Department, Secretary Department of Empowerment of Person Disabilities, Secretary Services, General Administration and Coordination Department, Dr. Mir Hassan Dahri",
        "Advocate Names for each party": "Appellant: Mr. Noor-ul-Haq Qureshi; Respondents: Mr. Rafique Ahmed Dahri",
        "Judge Name(s)": "MR. JUSTICE (R) SADIQ HUSSAIN BHATTI, MR. TARIQ MEHMOOD KHOSO, DR. KHALIL-UR-REHMAN SHAIKH",
        "Hearing Date": "10.03.2023",
        "Decision/Order Date": "10.04.2023",
        "Outcome of the Application": "Appeal is dismissed",
        "Cited Case Laws": "Judgment dated 12.06.2013 in Criminal Original Petition No.89/2011, Judgment dated 05.01.2015 in Civil Appeal No.404/2011, Civil Review Petition No.193/2013",
        "Short Summary of the Case": "The appellant challenged his repatriation to his parent department after being appointed by transfer to PITE. The tribunal found that the repatriation was in compliance with Supreme Court judgments and dismissed the appeal."
    },
    {
        "source_file": "Appeal_No._870_of_2018.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Zar Gul Khan Marwat vs. The Government of Sindh and others",
        "Case Number": "Appeal No. 70 of 2018",
        "Type of Petition or Application": "Service appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Zar Gul Khan Marwat (Appellant) vs. The Government of Sindh and others (Respondents)",
        "Advocate Names for each party": "Mr. Imran Ali Jatoi for the respondents; Appellant present in person",
        "Judge Name(s)": "Justice (R) Sadiq Hussain Bhatti, Tariq Mehmood Khoso",
        "Hearing Date": "24.04.2024",
        "Decision/Order Date": "16.05.2024",
        "Outcome of the Application": "Partly allowed; matter remanded to appellate authority for reconsideration",
        "Cited Case Laws": "Suo Moto Case No. 03 of 2012, CP No. 11 of 2012, GUL HASSAN JATOI and others v. FAQIR MUHAMMAD JATOI and others (2016 SCMR 1254)",
        "Short Summary of the Case": "The appellant challenges his demotion from Head Constable Driver to Constable and seeks the restoration of his seniority and promotion based on the directives of the Supreme Court of Pakistan."
    },
    {
        "source_file": "Appeal_No._907_of_2017.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Shabbir Ahmed Jokhio vs. The Chief Minister, Sindh & Others",
        "Case Number": "907 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Service Tribunals Act, 1973; Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Shabbir Ahmed Jokhio; Respondents: 1. The Chief Minister, Sindh; 2. The Chief Secretary, Sindh; 3. Province of Sindh",
        "Advocate Names for each party": "Appellant: Mr. Iftikhar Ahmed; Respondents: Mr. Asif Hussain Mangi",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "28.06.2018",
        "Decision/Order Date": "28.06.2018",
        "Outcome of the Application": "Penalty modified from removal from service to compulsory retirement",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Shabbir Ahmed Jokhio, challenged his removal from service due to allegations of misconduct while serving as District Education Officer. The tribunal modified the penalty to compulsory retirement after considering the circumstances of the case."
    },
    {
        "source_file": "Appeal_No._916_&_2326_of_2016.pdf",
        "Page count": 11,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Fayaz Ali vs The Chief Secretary, Government of Sindh and others",
        "Case Number": "Appeal No. 916 of 2016 and Appeal No. 2326 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 34/2014, Not mentioned in the document",
        "Legal Sections Involved": "Section 409, 420, 468, 471, 477-A, 109, 34 PPC",
        "Applicant and Respondents": "Applicant: Fayaz Ali and Abdul Wahid Jamali; Respondents: The Chief Secretary, Government of Sindh, The Secretary Finance, Government of Sindh",
        "Advocate Names for each party": "Mr. Malik Altaf Javed for the appellants; Mr. S. Kamil Shah, AAG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon",
        "Hearing Date": "03.03.2017",
        "Decision/Order Date": "28.03.2017",
        "Outcome of the Application": "The appeals stand dismissed",
        "Cited Case Laws": "PLD 1994 Supreme Court 222",
        "Short Summary of the Case": "The appeals arose from a common order involving allegations of misappropriation of government funds by the appellants, leading to their compulsory retirement. The tribunal upheld the decisions of the lower authority based on sufficient documentary evidence."
    },
    {
        "source_file": "Appeal_No._927_of_2016.pdf",
        "Page count": 9,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Agha Abdul Naeem vs. Inspector General of Police, Sindh Karachi",
        "Case Number": "927 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No.77/2010, FIR No.51/2011, FIR No.53/2011, FIR No.36/2011, FIR No.09/2012, FIR No.274/2014, FIR No.277/2014, FIR No.40/2009",
        "Legal Sections Involved": "Section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Agha Abdul Naeem; Respondents: Inspector General of Police, Additional Inspector General of Police, Deputy Inspector General of Police",
        "Advocate Names for each party": "Mr. Imdad Ali M. Ujjan for the appellant; Mr. S. Kamil Shah, A.A.G. Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Memon, Farooq Azam Memon",
        "Hearing Date": "21.10.2016",
        "Decision/Order Date": "24.11.2016",
        "Outcome of the Application": "Appeal dismissed with modification of penalty to compulsory retirement",
        "Cited Case Laws": "Basharat Ali vs. Director Excise and Taxation, Lahore; Abdul Sattar vs. Pakistan Water and Power Development Authority; Tasleem Akhtar vs. Pakistan",
        "Short Summary of the Case": "The appellant, Agha Abdul Naeem, challenged his dismissal from service after 26 years in the police, citing lack of due process and insufficient evidence for the allegations against him. The tribunal modified the dismissal to compulsory retirement based on the cumulative effect of his service record."
    },
    {
        "source_file": "Appeal_No._94_of_2018.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Iffat Ghazala D/o Mian Muhammad Yousif (Late) vs Province of Sindh and others",
        "Case Number": "Appeal No. 299 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Iffat Ghazala; Respondents: Province of Sindh, Secretary School Education Department, Directorate Schools Education, District Education Officer, Ms. Nasreen D/o Allah Jurio",
        "Advocate Names for each party": "Appellant: Mr. Mian Mohsin Raza; Respondents: Ms. Khalida Parveen Shaikh, Mr. Pervaiz Ahmed Memon, Mr. Ghulam Asghar Mirbahar",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "04.10.2018",
        "Decision/Order Date": "04.10.2018",
        "Outcome of the Application": "Appeal is allowed and the impugned order dated 03.04.2018 is set aside",
        "Cited Case Laws": "Anita Turab reported as PLD 2013 (SC) 195",
        "Short Summary of the Case": "The appellant challenged her frequent transfers within the Education Department, arguing they were politically motivated and violated departmental rules. The tribunal found the transfers unjustified and ruled in favor of the appellant."
    },
    {
        "source_file": "Appeal_No._95_of_2012.pdf",
        "Page count": 49,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Syed Tanveer Hussain Shah vs. Province of Sindh and others",
        "Case Number": "Appeal No. 95 of 2012",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Civil Servants Act, 1973; Sindh Civil Servants (Probation, Confirmation and Seniority) Rules, 1975",
        "Applicant and Respondents": "Applicant: Syed Tanveer Hussain Shah; Respondents: Province of Sindh, Chief Minister, Secretary, Communication & Works Department, and others",
        "Advocate Names for each party": "Mr. Shabir Ahmed Awan for the appellant; Mr. S. Kamil Shah, A.A.G. Sindh for official respondents; Mr. M.M. Aqil Awan for private respondents",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Ameer Faisal, Member-I",
        "Hearing Date": "03.10.2013",
        "Decision/Order Date": "28.10.2013",
        "Outcome of the Application": "The combined/joint seniority list of the Executive Engineers (BS-18) of the Works and Services Department as stood on 01.03.2012 is set aside.",
        "Cited Case Laws": "Supreme Court of Pakistan in CRP No.1-K/2011 in CA No.70-K/2010",
        "Short Summary of the Case": "The appellant challenged the joint seniority list of Executive Engineers, claiming it violated his seniority rights based on his earlier appointment and the rules governing seniority."
    },
    {
        "source_file": "Appeal_No._95_of_2018.pdf",
        "Page count": 10,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Raja Muhammad Arif vs. The Inspector General of Police, Sindh Police",
        "Case Number": "Appeal No. 95 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 88/2016 u/s 365-A/34, Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Raja Muhammad Arif; Respondents: 1. The Inspector General of Police, 2. The Additional Inspector General Police, 3. Senior Superintendent of Police",
        "Advocate Names for each party": "For Appellant: Mr. Altaf Ahmed Sheikh; For Respondents: Mr. Asif Hussain Mangi, Ms. Khalida Parveen Shaikh",
        "Judge Name(s)": "JUSTICE (R) QAISER IQBAL, CHAIRPERSON; MR. SHOUKAT ALI MEMON, MEMBER-I",
        "Hearing Date": "15.08.2018",
        "Decision/Order Date": "10.09.2018",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Raja Muhammad Arif, challenged the decision regarding his promotion to the rank of Inspector, which was not considered by the Departmental Promotion Committee. The tribunal dismissed the appeal on procedural grounds."
    },
    {
        "source_file": "Appeal_No._970_of_2019_(29_Others).pdf",
        "Page count": 16,
        "Court Name": "Sindh Service Tribunal Karachi (Camp at Larkana)",
        "Case Title": "Ubedullah vs. Inspector General of Police Sindh",
        "Case Number": "APPEAL NO. 970 OF 2019",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Ubedullah; Respondents: Inspector General of Police Sindh, Deputy Inspector General of Police Larkano Range, Senior Superintendent of Police Shikarpur",
        "Advocate Names for each party": "Mr. Ghulam Sarwar Chandio, advocate for the appellants; Mr. Abdul Waris Bhutto, Assistant A.G. along with SIP Zulfigar Ali for the respondents",
        "Judge Name(s)": "Justice (R) Sadiq Hussain Bhatti, Tariq Mehmood Khoso",
        "Hearing Date": "26.03.2024",
        "Decision/Order Date": "24.04.2024",
        "Outcome of the Application": "Service appeals of certain Tracker Constables allowed; others dismissed",
        "Cited Case Laws": "2024 SCMR 181, 2003 SCMR 830, 2010 SCMR 237, 2009 SCMR 339, 2015 SCMR 1418, 2015 SCMR 1257",
        "Short Summary of the Case": "The appellants, discharged from service on grounds of irregularities in their appointments, appealed for reinstatement. The Tribunal allowed some appeals while dismissing others based on age and participation in re-examination."
    },
    {
        "source_file": "Appeal_Nos._107_108_117_of_2014.pdf",
        "Page count": 30,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Ameer Azam Wassan v. Government of Sindh and others; Khuram Mughal v. Government of Sindh and others; Abdul Majeed Panhyar v. Province of Sindh and others",
        "Case Number": "S.A Nos. 107, 108 & 117 of 2014",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Civil Servants Act, 1973; Sindh Civil Servants (Probation, Confirmation and Seniority) Rules, 1975",
        "Applicant and Respondents": "Applicants: Ameer Azam Wassan, Khuram Mughal, Abdul Majeed Panhyar; Respondents: Government of Sindh, Chief Minister Sindh, Chief Secretary Sindh, Secretary Works & Services Department",
        "Advocate Names for each party": "Mr. Jamil Ahmed Rajpar (for appellants in appeal Nos. 107 and 108); Mr. Malik Naeem Iqbal (for appellant in appeal No. 117); Mr. S. Kamil Shah, AAG (for respondents); Mr. Rehan Kayani (holding brief for Mr. Salahuddin Ahmed)",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Ameer Faisal, Mr. Faroog Azam Memon",
        "Hearing Date": "08.08.2014",
        "Decision/Order Date": "22.08.2014",
        "Outcome of the Application": "All the appeals are allowed; the impugned order of merger is set aside.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellants challenged the merger of seniority lists of Civil, Electrical, and Mechanical Engineers, arguing that their qualifications and duties are distinct. The Tribunal ruled that the merger was unlawful and ordered separate seniority lists to be maintained."
    },
    {
        "source_file": "Appeal_Nos._162_163_164_165_of_2017.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Hakim Ali Metlo and others vs. Province of Sindh and others",
        "Case Number": "Appeal No. 162 of 2017, 163 of 2017, 164 of 2017, 165 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Hakim Ali Metlo, Sanaullah, Khaliq Dino, Waheed Ali vs. Province of Sindh, Chief Engineer Guddu Barrage Region Sukkur, Superintending Engineer, District Accounts Officer",
        "Advocate Names for each party": "Mr. Muhammad Saleem Khaskheli for the appellant; Mr. Asif Hussain Mangi, Ms. Khalida Parveen Shaikh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "21.09.2017",
        "Decision/Order Date": "17.10.2017",
        "Outcome of the Application": "Appeal stands allowed; respondents directed to release salary",
        "Cited Case Laws": "Hameed Akhter Niazi Vs. Secretary Establishment Division & Others, 1996. SCMR 1185; Tara Chand and others Vs. Karachi Water and Sewerage Board & others, 2005 SCMR 499; Pakistan International Airlines Corporation through Chairman and others Vs. Shahzad Farooq Malik & another, 2004 SCMR 158",
        "Short Summary of the Case": "The appellants challenged the rejection of their departmental appeal for salary release due to alleged irregular appointments. The Tribunal found discrimination against the appellants and directed the release of their salaries."
    },
    {
        "source_file": "Appeal_Nos._162_163_of_2013.pdf",
        "Page count": 19,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Ameer Azam Wassan versus The Chief Secretary Sindh and another",
        "Case Number": "S.A. No. 162 & 163 of 2013",
        "Type of Petition or Application": "Application under section 12(2) CPC and Order 39, Rules 1 & 2",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 12(2) CPC, Order 39, Rules 1 & 2",
        "Applicant and Respondents": "Applicant: Ameer Azam Wassan; Respondents: The Chief Secretary Sindh and another",
        "Advocate Names for each party": "Appellants: Mr. Jamil Ahmed Rajpar; Respondents: Mr. S. Kamil Shah, A.A.G.; Applicants/Interveners: Mr. Salahuddin Ahmed and Ms. Amber Lakhani",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Mr. Ameer Faisal, Mr. Faroog Azam Memon",
        "Hearing Date": "12.05.2014",
        "Decision/Order Date": "20.05.2014",
        "Outcome of the Application": "Application under section 12(2) CPC dismissed as incompetent",
        "Cited Case Laws": "Asad Ali Khan v. Chairman, Pakistan Telecommunication Corporation, Islamabad; Sajjad Ahmed Javed Bhatti v. Secretary, Establishment Division",
        "Short Summary of the Case": "The case involves appeals challenging the issuance of a joint seniority list and allegations of fraud and misrepresentation in obtaining a prior order. The tribunal dismissed the applications under section 12(2) CPC, stating that the order in question was not final."
    },
    {
        "source_file": "Appeal_Nos._1660_1661_of_2015.pdf",
        "Page count": 19,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Ismail Lashari and Muhammad Ishaq Lashari vs The Addl. Inspector General of Police Karachi Range and The Deputy Inspector General of Police, South Zone",
        "Case Number": "Appeal No. 1660 of 2015 and Appeal No. 1661 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 90/2015 dated Not mentioned in the document",
        "Legal Sections Involved": "Removal From Service (Special Powers) Sindh Ordinance 2000",
        "Applicant and Respondents": "Applicants: Muhammad Ismail Lashari and Muhammad Ishaq Lashari; Respondents: The Addl. Inspector General of Police Karachi Range and The Deputy Inspector General of Police, South Zone",
        "Advocate Names for each party": "Mr. Sanaullah Noor Ghouri for the appellants; Mr. S. Kamil Shah, AAG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal, Farooq Azam Memon",
        "Hearing Date": "07.03.2016",
        "Decision/Order Date": "07.04.2016",
        "Outcome of the Application": "Remanded for de-novo proceedings",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "Both appellants were dismissed from service based on allegations of misconduct and illegal activities. The tribunal found the dismissal orders to be without jurisdiction and remanded the cases for proper proceedings."
    },
    {
        "source_file": "Appeal_Nos._2306_2307_2308_2311_of_2016.pdf",
        "Page count": 11,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Wajid Ali Solangi and others vs Chief Secretary and others",
        "Case Number": "Appeal No. 2306 of 2016, 2307 of 2016, 2308 of 2016, 2311 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicants: Wajid Ali Solangi, Rizwan Ahmed Memon, Kashif Ahmed Shaikh, Imran Ali Dhamrah; Respondents: Chief Secretary, Secretary Forests, Environment & Wildlife Department, Rab Dino, Sain Bux, Abdul Haleem, Abdul Fatah, Zeeshan Ali",
        "Advocate Names for each party": "Mr. Muhammad Arshad Khan Tanoli for the appellants; Ms. Khalida Parveen Shaikh, State Counsel for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Iqbal Ahmad Soomro",
        "Hearing Date": "02.08.2017",
        "Decision/Order Date": "25.08.2017",
        "Outcome of the Application": "The impugned notification dated 02.06.2016 is set aside; a fresh seniority list is to be prepared.",
        "Cited Case Laws": "Khushi Muhammad v. The General Manager, Pakistan Western Railway PLD 1970 SC 203; Federation of Pakistan v. Azam Ali 1985 SCMR 386",
        "Short Summary of the Case": "The appellants challenged the seniority notification dated 02.06.2016, claiming it violated the prescribed quota for direct recruits and promotees in the Sindh Forest Department. The tribunal found discrepancies in the seniority list and directed the preparation of a new list in accordance with the law."
    },
    {
        "source_file": "Appeal_Nos._2387_2542_of_2016_&_244_334_of_2017.pdf",
        "Page count": 13,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Aijaz Ali Memon vs. The Secretary, Home Department & Another",
        "Case Number": "Appeal No. 2387 of 2016, Appeal No. 2542 of 2016, Appeal No. 244 of 2017, Appeal No. 334 of 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicants: Aijaz Ali Memon, Ayaz Ahmed Pandhiani, Kanbho Khan Mari, Syed Abu Talha Umrao; Respondents: The Secretary Home Department, Inspector General Police Sindh",
        "Advocate Names for each party": "M/s. Malik Naeem Iqbal, Malik Altaf Javed & Muhammad Saleem Khaskheli for appellants; M/s. Naveed Ahmed, Syed Ansar Hussain Zaidi and Saud Ahmed Khan for appellant in Appeal No. 334/2017; Mr. Asif Hussain Mangi, Addl: AG, Sindh and Ms. Khalida Parveen Shaikh for respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "25.8.2017 & 30.8.2017",
        "Decision/Order Date": "27.9.2017",
        "Outcome of the Application": "All Appeals dismissed with no orders as to cost",
        "Cited Case Laws": "Judgment dated 06.05.2016 by Honorable Supreme Court of Pakistan",
        "Short Summary of the Case": "The appellants challenged the Final Seniority List dated 18.7.2016 issued by the IGP Sindh, claiming it was prepared in violation of Police Rules. The tribunal upheld the seniority list and dismissed the appeals."
    },
    {
        "source_file": "Appeal_Nos._276_277_278_279_of_2017.pdf",
        "Page count": 13,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Bhai Khan S/o Haji Dhengano and others vs. Director, School Education (Primary) and others",
        "Case Number": "APPEAL NO. 2760F 2017, APPEAL NO. 2770F 2017, APPEAL NO. 2780F 2017, APPEAL NO. 2790F 2017",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicants: Bhai Khan, Muhammad Rasheed, Mst. Shaheen, Mst. Naseem Akhtar; Respondents: Director, School Education (Primary), District Education Officer (Female), The Secretary, Government of Sindh",
        "Advocate Names for each party": "Mr. Abdul Sattar Mughal for the appellant; Mr. Asif Hussain Mangi, Addl: AG Sindh along with Mr. Javed Ali for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Mr. Shoukat Ali Memon, Mr. Iobal Ahmad Soomro",
        "Hearing Date": "13.08.2018",
        "Decision/Order Date": "07.09.2018",
        "Outcome of the Application": "The appeals being misconceived are accordingly dismissed.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellants, who were terminated from their positions as Chowkidars and Primary School Teachers, claimed reinstatement, arguing they were victimized politically. The tribunal found their appointments to be bogus and dismissed their appeals."
    },
    {
        "source_file": "Appeal_Nos._318_319_320_321_322_323_324_325_326_327_328_329_330_331_332_340_341_342_of_2017.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Azhar Shoro and others vs The Inspector General, Sindh Police and others",
        "Case Number": "APPEAL NO. 318 OF 2017 to APPEAL NO. 342 OF 2017",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicants: Muhammad Azhar Shoro, Abid Ali, Anees Ahmed, Irfan Khan, Zulfiqar Ali, Faisal Hasan, Muhammad Ahmed Khan Sherani, Shoaib Ahmed Qureshi, Syed Arsalan Hyder Zaidi, Muhammad Farhan, Kashif, Fahad ul Islam, Babar Ali, Afzal Illahi Abbasi, Muhammad Ahmed Shaikh, Zulfiqar Hussain, Malik Muhammad Ameen, Yar Muhammad; Respondents: The Inspector General, Sindh Police, Deputy Inspector General of Police, Senior Superintendent of Police Hyderabad",
        "Advocate Names for each party": "Syed Muhammad Saulat Rizvi for the appellants; Mr. Asif Hussain Mangi, Ms. Khalida Parveen Shaikh, and PI Syed Manzoor Ali for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Mr. Shoukat Ali Memon, Mr. Iqbal Ahmad Soomro",
        "Hearing Date": "18.08.2017",
        "Decision/Order Date": "29.08.2017",
        "Outcome of the Application": "All appeals dismissed",
        "Cited Case Laws": "HRC No.16082-S/2015, Civil Petition for leave to Appeal Nos. 634-K, 635-K, 644-K, 645-K, 646-K of 2016",
        "Short Summary of the Case": "The appellants, police constables, challenged their discharge from service based on a Supreme Court order regarding irregular appointments. They argued that their cases were different and sought reinstatement and back benefits."
    },
    {
        "source_file": "Appeal_Nos._65_66_67_68_69_70_71_72_of_2016.pdf",
        "Page count": 24,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Sikandar Ali Khuwaja vs. The Province of Sindh and others",
        "Case Number": "Appeal No. 65 of 2016",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Sikandar Ali Khuwaja; Respondents: The Province of Sindh, The Chief Secretary, Government of Sindh, The Secretary Public Health Engineering Department, The Secretary Services & General Administration Department",
        "Advocate Names for each party": "Mr. Abdul Salam Memon for all the appellants",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Chairman; Mr. Farooq Azam Memon, Member-II",
        "Hearing Date": "23.02.2016",
        "Decision/Order Date": "23.02.2016",
        "Outcome of the Application": "All the appeals stand dismissed in limine.",
        "Cited Case Laws": "Sarosh Hiader Vs. Muhammad Javed Chundrigar, PLD 2014, Supreme Court 338; General (R) Pervez Musharraf Vs. Nadeem Ahmed (Advocate) PLD 2014 Supreme Court 585.",
        "Short Summary of the Case": "The appellants, who were Graduate Engineers appointed as Sub Engineers, sought promotion to Assistant Engineer based on completion of five years service. Their appeals were dismissed on grounds of being time-barred and not having challenged prior appointments and seniority."
    },
    {
        "source_file": "Appeal_Nos._738_739_740_741_742_743_744_745_746_747_748_749_750_751_752_753_754_755_of_2017.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Ghulam Hussain Mari and others vs Inspector General of Police Sindh and others",
        "Case Number": "APPEAL NO. 738 OF 2017",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicants: Ghulam Hussain Mari, Abdul Ghaffar, Rasool Bux, Ghulam Rasool Gill, Shaukat Ali, Noor Muhammad Chandio, Abdul Hameed, Khawand Bux, Mahmood Ahmed, Manzoor Ahmed, Muhammad Arshad, Muhammad Azam, Muhammad Faroog Ahmed, Muhammad Hashim, Muhammad Tufail, Rab Nawaz, Haji, Muhammad Shareef. Respondents: Inspector General of Police Sindh, Deputy Inspector General, Shaheed Benazir Abad Range.",
        "Advocate Names for each party": "Mr. Muhammad Saulat Rizvi advocate for the Appellant; Mr. Asif Hussain Mangi, Addl: AG, Sindh for the respondents.",
        "Judge Name(s)": "JUSTICE (R) QAISER IQBAL, SHOUKAT ALI MEMON, IQBAL AHMAD SOOMRO",
        "Hearing Date": "28.02.2018",
        "Decision/Order Date": "02.04.2018",
        "Outcome of the Application": "All the above appeals are disposed of accordingly.",
        "Cited Case Laws": "Service Appeal No.128/2014 dated 31.10.2014; Appeal No.1209/2015 dated 09.10.2015; Civil Petition No.683-K of 2015.",
        "Short Summary of the Case": "The appeals arise from the de-notification of the appellants from the rank of Sub Inspector back to Assistant Sub Inspector due to alleged ineligibility based on seniority rules. The tribunal directed the respondent to decide the pending departmental appeal of the appellants after giving them an opportunity for a personal hearing."
    },
    {
        "source_file": "Appeal_Nos._88_&_174_of_2014.pdf",
        "Page count": 15,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Muhammad Ashraf Khaskheli vs. Province of Sindh and others",
        "Case Number": "S.A. Nos. 88 & 174 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Article 199 of the Constitution of Islamic Republic of Pakistan",
        "Applicant and Respondents": "Appellants: Muhammad Ashraf Khaskheli, Muhammad Ishaq Lashari, Irshad Hussain Brohi; Respondents: Province of Sindh, Secretary Education & Literacy Department, Sindh Public Service Commission",
        "Advocate Names for each party": "Barrister Zamir Ghumro for the appellants; Mr. S. Kamil Shah, AAG Sindh along with Mr. Abdul Aziz for respondents No.1 & 3; Mr. M.M Aqil Awan along with Mr. Zakir Ali Shah for respondent No.2",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal",
        "Hearing Date": "26.02.2015",
        "Decision/Order Date": "30.03.2015",
        "Outcome of the Application": "Appeals dismissed",
        "Cited Case Laws": "Ali Azhar Khan Baloch v. Province of Sindh, Karachi Building Control Authority v. Hashwani Sales and Services Limited, Fida Hussain v. The Secretary, Kashmir Affairs, Zafar Iqbal v. Director Secondary Education, Executive District Officer (Revenue) v. Ijaz Hussain, Syed Mehmood Akhtar Naqvi v. Federation of Pakistan, Ghulam Rasool v. Government of Pakistan",
        "Short Summary of the Case": "The appellants sought a declaration against the legality of a notification regarding recruitment rules in the Education and Literacy Department, claiming it adversely affected their promotional prospects. The Tribunal found the amendments within the competence of the Secretary and dismissed the appeals."
    },
    {
        "source_file": "Appeal_Nos._91_&_92_of_2018.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Mumtaz Ali Khaskheli vs. Province of Sindh and others",
        "Case Number": "Appeal No. 91 of 2018 & Appeal No. 92 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Mumtaz Ali Khaskheli; Respondents: 1. Province of Sindh, 2. Inspector General of Police Sindh, 3. Additional Inspector General of Police, 4. Senior Superintendent of Police",
        "Advocate Names for each party": "Advocate for Appellant: Mr. Ahmed Ali Ghumro; Advocates for Respondents: Mr. Asif Hussain Mangi, Inspector Nawaz Minhas, Inspector Zafar, ASI M. Imran",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "02.04.2018",
        "Decision/Order Date": "04.05.2018",
        "Outcome of the Application": "Appeals No. 91/2018 & 92/2018 are allowed",
        "Cited Case Laws": "Anita Turab V/s. Federation of Pakistan, Zahid Akhtar v. Government of Punjab",
        "Short Summary of the Case": "The appellant challenged frequent transfers and alleged malice in the actions taken against him, leading to the cancellation of the impugned notification regarding his transfer."
    },
    {
        "source_file": "Appeal_No._127_of_2018.pdf",
        "Page count": 7,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Ali Asghar Jamali v. The Addl: Inspector General of Police Sindh",
        "Case Number": "Appeal No. 127 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973; Section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Ali Asghar Jamali; Respondents: 1. The Addl: Inspector General of Police Sindh, 2. Deputy Inspector General of Police East Zone, 3. Senior Superintendent of Police, District Malir",
        "Advocate Names for each party": "Mr. Ghulam Sarwar Chandio for the appellant; Mr. Asif Hussain Mangi Addl. A.G Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Iqbal Ahmad Soomro",
        "Hearing Date": "02.08.2018 & 10.08.2018",
        "Decision/Order Date": "29.08.2018",
        "Outcome of the Application": "Appellant reinstated in service",
        "Cited Case Laws": "Basharat Ali V/s. Director Excise & Taxation Lahore, 1997 PLC (CS) 817; Nawab Khan and another V/s. Government of Pakistan through Secretary, Ministry of Defence, Rawalpindi & others, PLD 1994 SC 222; Pakistan International Airlines Corporation v/s Ms. Shaista Naheed, 2004 SGMR 316; Inspector General of Police Headquarters, office, Karachi and others v/s Shafgat Mehmood, 2003 SCMR 207; Executive Engineers Peco Limited and another v/s Liaquat Ali, 2010 SCMR 237",
        "Short Summary of the Case": "The appellant, a former police constable, appealed against his dismissal from service due to alleged misconduct. The tribunal found that proper inquiry was not conducted and reinstated the appellant."
    },
    {
        "source_file": "Appeal_No._100_of_2018.pdf",
        "Page count": 4,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Gulsher Rahujo S/o Muhammad Hashim Rahujo vs Chief Secretary Government of Sindh and Secretary Livestock & Fisheries Department",
        "Case Number": "Appeal No. 100 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunal Act, 1973",
        "Applicant and Respondents": "Applicant: Gulsher Rahujo; Respondents: Chief Secretary Government of Sindh, Secretary Livestock & Fisheries Department",
        "Advocate Names for each party": "Mr. Ghulam Sarwar Chandio for the appellant; Mr. Asif Hussain Mangi, Addl AG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "27.11.2018",
        "Decision/Order Date": "27.11.2018",
        "Outcome of the Application": "Case remanded to the respondent No.1 for deciding the departmental appeal of appellant within 30 days",
        "Cited Case Laws": "SBLR 2013 SC 49, Muhammad Yousaf Vs Abdul Rashid (1996 SCMR 1297), Abdul Saeed Vs Government of NWFP (1990 SCMR 1623)",
        "Short Summary of the Case": "The appellant, Gulsher Rahujo, sought retrospective promotion to the post of Deputy Director Fisheries from 20.02.2012 instead of 14.03.2017, claiming that the promotion was unjustly delayed due to disputes over seniority."
    },
    {
        "source_file": "Appeal_No._1023_of_2018.pdf",
        "Page count": 5,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Shabbir Ahmed Pandhiani vs Chief Secretary, Government of Sindh",
        "Case Number": "Appeal No. 1023 of 2018",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Applicant: Shabbir Ahmed Pandhiani; Respondents: Chief Secretary, Government of Sindh; Planning & Development Board; Planning & Development Department",
        "Advocate Names for each party": "Mr. Ali Asadullah Bullo for the appellant; Mr. Asif Hussain Mangi, Addl. AG Sindh along with Syed Mehboob Ali and Mr. Dhani Buksh Bhutto for the respondents",
        "Judge Name(s)": "JUSTICE (R) MUHAMMAD SADIQ LEGHARI, CHAIRMAN; MR. IQBAL AHMAD SOOMRO, MEMBER",
        "Hearing Date": "16.10.2019",
        "Decision/Order Date": "27.11.2019",
        "Outcome of the Application": "Appeal accepted partly; period of temporary service counted for pensionary benefits",
        "Cited Case Laws": "Rizwan Javed and others reported in PLC (C.S.) 712; Qayoom Khan reported in 2017 PLC (C.S.) 428",
        "Short Summary of the Case": "The appellant challenged the dismissal of his service and sought to have his previous service counted for pensionary benefits after being reinstated on humanitarian grounds."
    },
    {
        "source_file": "Appeal_No._1101_of_2018.pdf",
        "Page count": 5,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Zakir Hussain Samo vs The Chief Secretary Sindh & Others",
        "Case Number": "Appeal No. 1101 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Zakir Hussain Samo (Appellant) vs 1. The Chief Secretary Sindh 2. Secretary Service & General Administration 3. Chairman Anti-Corruption Establishment, Sindh 4. Syed Imdad Ali Shah (Respondents)",
        "Advocate Names for each party": "Mr. Muhammad Arshad Khan Tanoli (for the appellant), Mr. Asif Hussain Mangi, Ms. Khalid Parveen Shaikh (for the respondents)",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "17.01.2019",
        "Decision/Order Date": "11.02.2019",
        "Outcome of the Application": "The impugned notification dated 14.12.2018 is set aside",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant challenged his frequent transfers and the legality of the impugned notification issued for his transfer, which was found to be without lawful authority."
    },
    {
        "source_file": "Appeal_No._1119_of_2021.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Dr. Saeed Ahmed Shaikh vs The Chief Minister Sindh and others",
        "Case Number": "Appeal No. 1119 of 2021",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Dr. Saeed Ahmed Shaikh; Respondents: The Chief Minister Sindh, Chief Secretary, Government of Sindh, The Secretary, Health Department",
        "Advocate Names for each party": "Mr. Ghulam Sarwar Chandio for the appellant; Mr. Asif Hussain Mangi, Addl. AG Sindh along with Mr. Sher Muhammad Noonariy and Mr. Agha Altaf Hussain for the respondents",
        "Judge Name(s)": "Tariq Mehmood Khoso, Dr. Khalil-ur-Rehman Shaikh",
        "Hearing Date": "21.10.2022",
        "Decision/Order Date": "10.11.2022",
        "Outcome of the Application": "Appeal allowed with direction to issue notification of proforma promotion to BPS-20",
        "Cited Case Laws": "Maj. ZIA-UL-HASSAN, HOME SECRETARY and others Vs. Mrs. NASEEM CHAUDHRY; Sh. MUHAMMAD RIAZ Vs. GOVERNMENT OF THE PUNJAB",
        "Short Summary of the Case": "The appellant's promotion was deferred due to suspension related to an inquiry. The inquiry later found no basis for the suspension, leading to the appeal for promotion being allowed."
    },
    {
        "source_file": "Appeal_No._113_of_2018.pdf",
        "Page count": 3,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Fatehullah Soomro vs. Province of Sindh",
        "Case Number": "Appeal No. 113 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Fatehullah Soomro; Respondents: Province of Sindh, Secretary Schools Education & Literacy Department, Director Schools Education, District Education Officer, Sub-Divisional Officer",
        "Advocate Names for each party": "Appellant in person: Fatehullah Soomro; Respondents: Mr. Asif Hussain Mangi, Mr. Faheed Ahmed Memon",
        "Judge Name(s)": "JUSTICE (R) QAISER IQBAL, SHOUKAT ALI MEMON, IQBAL AHMAD SOOMRO",
        "Hearing Date": "03.04.2018",
        "Decision/Order Date": "03.04.2018",
        "Outcome of the Application": "Dismissed in limine",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Fatehullah Soomro, appealed against the dismissal of his services as a Primary School Teacher after 25 years, but the appeal was dismissed as time-barred."
    },
    {
        "source_file": "Appeal_No._1175_of_2016.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Ghulam Nabi S/o Niaz Muhammad vs. The Director, Ghotki Feeder Canal Area, Water Board, Ghotki and others",
        "Case Number": "Appeal No. 1175 of 2016",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Ghulam Nabi; Respondents: 1. The Director, Ghotki Feeder Canal Area, Water Board, Ghotki; 2. The Executive Engineer, Ghotki Tubewell Division, Ghotki; 3. The District Accounts Officer, Ghotki @ Mirpur Mathelo.",
        "Advocate Names for each party": "Mr. S.Kamil Shah, AAG Sindh for the respondents; Appellant present in person.",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Chairperson; Shoukat Ali Memon, Member-I",
        "Hearing Date": "01.03.2017",
        "Decision/Order Date": "22.03.2017",
        "Outcome of the Application": "Appeal stands allowed; respondents directed to release the salary of the appellant within 15 days.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Ghulam Nabi, challenged the impugned letter and order regarding non-payment of salary since his appointment as Tubewell Chowkidar. The tribunal found the appointment valid and directed the respondents to release the salary."
    },
    {
        "source_file": "Appeal_No._117_of_2019.pdf",
        "Page count": 4,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Manzoor Ali Kalhoro vs. The Secretary, Works and Services Department, Government of Sindh",
        "Case Number": "Appeal No. 117 of 2019",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973; Section 10 of the Sindh Civil Servants Act, 1973",
        "Applicant and Respondents": "Applicant: Manzoor Ali Kalhoro; Respondents: 1. The Secretary, Works and Services Department, Government of Sindh; 2. Ishrat Pervez Chandio",
        "Advocate Names for each party": "For Appellant: Syed Muhammad Saulat Rizvi; For Respondent No. 1: Mr. Asif Hussain Mangi, Ms. Khalida Parveen Shaikh; For Respondent No. 2: Mr. Altamash Arab",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "13.06.2019",
        "Decision/Order Date": "13.06.2019",
        "Outcome of the Application": "The appeal stands dismissed.",
        "Cited Case Laws": "Anita Turab case",
        "Short Summary of the Case": "The appellant challenged his transfer order, claiming it was premature and illegal, while the respondents defended the transfer as administrative. The tribunal found the transfer justified and dismissed the appeal."
    },
    {
        "source_file": "Appeal_No._1231_of_2015.pdf",
        "Page count": 8,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Zahid Hussain Hulio vs. Chief Secretary to Government of Sindh",
        "Case Number": "Appeal No. 1231 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Not mentioned in the document",
        "Applicant and Respondents": "Zahid Hussain Hulio (Appellant), Chief Secretary to Government of Sindh, Finance Secretary Government of Sindh, Secretary Education & Literacy Department, Accountant General Sindh (Respondents)",
        "Advocate Names for each party": "Mr. S. Kamil Shah, AAG Sindh along with Mr. Khalid Malik (for respondents)",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal",
        "Hearing Date": "16.12.2015",
        "Decision/Order Date": "23.12.2015",
        "Outcome of the Application": "The appeal is allowed; the deduction of conveyance allowance during summer and winter vacations is declared violative of the Sindh Civil Service Rules.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant contended that the deduction of conveyance allowance during summer vacation for teaching staff is discriminatory and infringes fundamental rights. The Tribunal ruled that vacation counts as duty, and the deduction is not permissible."
    },
    {
        "source_file": "Appeal_No._125_of_2014.pdf",
        "Page count": 5,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Zamir Hussain vs The Chief Secretary, Government of Sindh and The Secretary Transport, Government of Sindh",
        "Case Number": "Appeal No. 125 of 2014",
        "Type of Petition or Application": "Not mentioned in the document",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Zamir Hussain; Respondents: 1. The Chief Secretary, Government of Sindh; 2. The Secretary Transport, Government of Sindh",
        "Advocate Names for each party": "Appellant: Mr. Maula Buksh Khoso; Respondent No.1: Mr. S. Kamil Shah, AAG; Respondent No.2: Ms. Fauzia Sikandar",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Chairman",
        "Hearing Date": "Not mentioned in the document",
        "Decision/Order Date": "30.10.2014",
        "Outcome of the Application": "The appeal is allowed; the impugned orders are set aside and the matter is remanded for fresh proceedings.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant challenged the orders of reduction in rank and dismissal of representation, arguing that the inquiry was not conducted as per legal requirements."
    },
    {
        "source_file": "Appeal_No._128_of_2014.pdf",
        "Page count": 4,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Meraj Anwar vs Province of Sindh",
        "Case Number": "Appeal No. 128 of 2014",
        "Type of Petition or Application": "Not mentioned in the document",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Police Rules 12.2 (3)",
        "Applicant and Respondents": "Applicant: Meraj Anwar; Respondents: Province of Sindh, Secretary Home, Inspector General Police, Additional Inspector General of Police",
        "Advocate Names for each party": "Appellant: Mr. Malik Naeem Iqbal; Respondents: Mr. S. Kamil Shah, A.A.G.",
        "Judge Name(s)": "MR. JUSTICE (R) MUJEEBULLAH SIDDIQUI, CHAIRMAN; MR. AMEER FAISAL, MEMBER-I",
        "Hearing Date": "31.10.2014",
        "Decision/Order Date": "31.10.2014",
        "Outcome of the Application": "Disposed of with directions regarding seniority list preparation",
        "Cited Case Laws": "Director General, Intelligence Bureau v. Amir Mujahid Khan, 2011-SCMR-389",
        "Short Summary of the Case": "The appellant challenged the seniority list of ASIs, and the tribunal directed that the final seniority list be prepared according to the relevant police rules, ensuring the appellant has the opportunity for personal hearing and to file objections."
    },
    {
        "source_file": "Appeal_No._136_of_2018.pdf",
        "Page count": 4,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Seema Kumbhar vs. L. Additional Inspector General of Police, Karachi Range",
        "Case Number": "Appeal No. 136 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Seema Kumbhar; Respondents: L. Additional Inspector General of Police, Karachi Range; Assistant Inspector General of Police (Security) Sindh",
        "Advocate Names for each party": "Appellant: Mr. Maula Buksh Khoso; Respondents: Mr. Asif Hussain Mangi",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Iqbal Ahmad Soomro",
        "Hearing Date": "25.09.2018",
        "Decision/Order Date": "30.10.2018",
        "Outcome of the Application": "The appeal stands disposed of with directions to the IGP Sindh to decide the representation of the appellant.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Seema Kumbhar, challenged her discharge from service by the Assistant Inspector General of Police, claiming lack of proper notice and procedure during her illness. The tribunal remanded the case to the IGP Sindh for a decision on the pending representation."
    },
    {
        "source_file": "Appeal_No._139_of_2018.pdf",
        "Page count": 5,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Atta Muhammad Khan vs. The Inspector General of Police Sindh",
        "Case Number": "Appeal No. 139 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No. 169/1993, FIR No. 193, FIR No. 170/2013",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973, Section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Atta Muhammad Khan; Respondents: The Inspector General of Police Sindh, The Additional Inspector General of Police, The Senior Superintendent of Police",
        "Advocate Names for each party": "Mr. Muhammad Rais Awan for the appellant; Ms. Khalida Parveen Shaikh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Mr. Shoukat Ali Memon, Mr. Iqbal Ahmad Soomro",
        "Hearing Date": "03.08.2018",
        "Decision/Order Date": "31.08.2018",
        "Outcome of the Application": "Appeal dismissed",
        "Cited Case Laws": "Muhammad Irshad alias Shada V/s. The State 1997 SCMR 951, The State and Director General Intelligence Bureau Islamabad V/s. Muhammad Javed & others 2012 SCMR 165",
        "Short Summary of the Case": "The appellant, Atta Muhammad Khan, challenged his compulsory retirement from service due to a patchy service record and involvement in criminal cases. The tribunal found no merit in the appeal and dismissed it."
    },
    {
        "source_file": "Appeal_No._140_of_2013.pdf",
        "Page count": 4,
        "Court Name": "SINDH SERVICE TRIBUNAL",
        "Case Title": "Not mentioned in the document",
        "Case Number": "APPEAL NO. 140/2013",
        "Type of Petition or Application": "M/A NO.246/2013 (UNDER SECTION 14 OF THE LIMITATION ACT 1908)",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 14 of the Limitation Act, 1908; Section 5 of the Limitation Act",
        "Applicant and Respondents": "Not mentioned in the document",
        "Advocate Names for each party": "Mr. Malik Naeem Iqbal, Advocate for the appellant",
        "Judge Name(s)": "JUSTICE (R) MUJEEBULLAH SIDDIQUI, AMEER FAISAL",
        "Hearing Date": "08.10.2013",
        "Decision/Order Date": "Not mentioned in the document",
        "Outcome of the Application": "The application for condonation of delay stands dismissed.",
        "Cited Case Laws": "Muhammad Arshad Saeed, D.I.G. Police v. Government of Pakistan, 1994-SCMR-1033; Sharif Ahmed Hashmi v. Chairman, Screening Committee, Lahore and another (1978 SCMR 367); Muhammad Raz Khan v. Government of N.W.F.P., 1997-PLC (C.S.)-600; PLD 1985 Sc 153; PLD 1993 SC 147; PLD 1996 SC 292; PLD 1995 Sc 396; 1986 SCMR 930; PLD-1982 SC (AJ&K) 13; PLD 1975 Baghdad-ul-Jadid 29",
        "Short Summary of the Case": "The application for condonation of delay was dismissed due to lack of satisfactory explanation for the delay of about 10 months in filing the appeal."
    },
    {
        "source_file": "Appeal_No._1420_of_2015.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Dr. Imtiaz Bhatti vs The Secretary, Health Department, Government of Sindh",
        "Case Number": "1420 of 2015",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 3 (e) of the RSO",
        "Applicant and Respondents": "Applicant: Dr. Imtiaz Bhatti; Respondent: The Secretary, Health Department, Government of Sindh",
        "Advocate Names for each party": "Appellant: Mr. Maula Buksh Khoso; Respondents: Mr. S. Kamil Shah, AAG Sindh along with Dr. Iqbal Nabi",
        "Judge Name(s)": "Justice (R) Mujeebullah Siddiqui, Ameer Faisal, Farooq Azam Memon",
        "Hearing Date": "06.11.2015",
        "Decision/Order Date": "06.11.2015",
        "Outcome of the Application": "The appeal is allowed and the notification dated 24.12.2013 is set aside.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant challenged a notification treating his suspension period as extraordinary leave without pay. The tribunal found the suspension order void as it was issued by an incompetent authority and ruled that the appellant is entitled to full pay and allowances during the suspension period."
    },
    {
        "source_file": "Appeal_No._1473_of_2016.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Dr. Amir Muavia Kazi vs. The Worthy Chief Minister and The Chief Secretary",
        "Case Number": "Appeal No. 1473 of 2016",
        "Type of Petition or Application": "Appeal under section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 3 and Section 5 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Dr. Amir Muavia Kazi; Respondents: The Worthy Chief Minister, The Chief Secretary",
        "Advocate Names for each party": "Appellant: Mr. Malik Altaf Javaid; Respondents: Mr. S. Kamil Shah, AAG Sindh",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Ali Memon",
        "Hearing Date": "02.03.2017",
        "Decision/Order Date": "27.03.2017",
        "Outcome of the Application": "The appeal is not maintainable in law and is hereby dismissed.",
        "Cited Case Laws": "Pakistan Petroleum Limited V/s. Javed Iqbal, Muhammad Ashraf V/s. Executive Engineer, Muhammad Riaz V/s. Inspector General of Police, Pakistan National Airline Corporation V/s. Ms. Shaista Naheed, Asad Baig Awan V/s. Habib Bank Limited",
        "Short Summary of the Case": "The appellant, Dr. Amir Muavia Kazi, was removed from service for unauthorized absence of over 7 years. He contested the removal, claiming he had applied for leave, but the tribunal found his absence constituted misconduct and dismissed the appeal."
    },
    {
        "source_file": "Appeal_No._147_of_2014.pdf",
        "Page count": 4,
        "Court Name": "Sindh Services Tribunal",
        "Case Title": "Faqir Muhammad Leghari V/s. The Chief Secretary Sindh & others",
        "Case Number": "Appeal No. 147 of 2014",
        "Type of Petition or Application": "Not mentioned in the document",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Civil Servants Act, 1973; Sindh Service Tribunals Act, 1973; Sindh Civil Servants (Appeal) Rules 1980",
        "Applicant and Respondents": "Faqir Muhammad Leghari (Applicant), The Chief Secretary Sindh & others (Respondents)",
        "Advocate Names for each party": "Mr. Ghulam Sarwar Chandio (for the appellant)",
        "Judge Name(s)": "Mr. Justice (R) Mujeebullah Siddiqui, Ameer Faisal, Faroog Azam Memon",
        "Hearing Date": "18.08.2014",
        "Decision/Order Date": "Not mentioned in the document",
        "Outcome of the Application": "Appeal is held to be not-maintainable in law and stands disposed of accordingly.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant claimed arrears for a period of leave but failed to provide sufficient evidence of pursuing his grievance with the Finance Department, leading to the dismissal of his appeal."
    },
    {
        "source_file": "Appeal_No._148_of_2018.pdf",
        "Page count": 5,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Kamran Ali Baloch vs The Province of Sindh & Others",
        "Case Number": "Appeal No. 148 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Service Tribunals Act, 1973; Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Kamran Ali Baloch; Respondents: The Province of Sindh, The Inspector General of Police Sindh, The Additional Inspector General of Police, The Senior Superintendent of Police (SSP)",
        "Advocate Names for each party": "Syed Abrar Ahmed Bukhari for the appellant; Mr. Asif Hussain Mangi, Addl: AG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Chairperson; Shoukat Ali Memon, Member-I",
        "Hearing Date": "21.06.2018",
        "Decision/Order Date": "21.06.2018",
        "Outcome of the Application": "Appeal allowed; appellant reinstated in service",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Kamran Ali Baloch, challenged his dismissal from service on the grounds that the authority who dismissed him was not competent to do so under the repealed ordinance. The tribunal found in favor of the appellant, allowing the appeal and directing a regular inquiry into the allegations against him."
    },
    {
        "source_file": "Appeal_No._149_of_2021.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal Karachi",
        "Case Title": "Faheem Hussain vs. Chief Secretary, Government of Sindh, et al.",
        "Case Number": "Appeal No.149 of 2021",
        "Type of Petition or Application": "Service Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunal Act, 1973",
        "Applicant and Respondents": "Applicant: Faheem Hussain; Respondents: Chief Secretary, Government of Sindh; Secretary, Government of Sindh for Law, Parliamentary Affairs and Criminal Prosecution Department; Secretary, Government of Sindh, Finance Department; Prosecutor General Sindh; Accountant General Sindh.",
        "Advocate Names for each party": "Appellant: Mr. Abbadul Hussnain; Respondents: Not mentioned in the document",
        "Judge Name(s)": "MR. JUSTICE (R) SADIQ HUSSAIN BHATTI, MR. TARIQ MEHMOOD KHOSO, DR. KHALIL-UR-REHMAN SHAIKH",
        "Hearing Date": "23.02.2023",
        "Decision/Order Date": "07.03.2023",
        "Outcome of the Application": "Directs respondents to approach Shaheed Zulfigar Ali Bhutto University for Law, Karachi for transferring the amount of funds deducted from the salary of the appellant.",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant, Faheem Hussain, seeks pay protection and the counting of his previous service for pension and retirement benefits after being appointed as Deputy Prosecutor General. The tribunal directed the respondents to ensure the transfer of deducted funds for the appellant's retirement benefits."
    },
    {
        "source_file": "Appeal_No._160_of_2023.pdf",
        "Page count": 4,
        "Court Name": "Sindh Service Tribunal, Karachi (Camp at Larkana)",
        "Case Title": "Saeed Raza son of Qadir Bux vs. Deputy Inspector General of Police Larkana Range and others",
        "Case Number": "Appeal No. 160 of 2023",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 4 of the Sindh Service Tribunals Act, 1973",
        "Applicant and Respondents": "Applicant: Saeed Raza; Respondents: 1. Deputy Inspector General of Police Larkana Range, 2. Senior Superintendent of Police Kashmore-Kandhkot, 3. Secretary Home Department Government of Sindh",
        "Advocate Names for each party": "Appellant: Mr. Muhammad Khan Brohi; Respondents: Mr. Abdul Waris Bhutto, Assistant A.G. along with SIP Abdul Waheed",
        "Judge Name(s)": "Tariq Mehmood Khoso, Dr. Khalil-ur-Rehman Shaikh",
        "Hearing Date": "202.2023",
        "Decision/Order Date": "12.01.2024",
        "Outcome of the Application": "Dismissed",
        "Cited Case Laws": "Ex-Constable Muhammad Farooq v. I.G. Police Islamabad, Muhammad Hanif v. S.P. Lahore",
        "Short Summary of the Case": "The appellant, a police constable, was awarded compulsory retirement for unauthorized absence from duty. The appeal was dismissed as the absence was deemed willful and the medical records submitted were found unsatisfactory."
    },
    {
        "source_file": "Appeal_No._164_of_2021.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal at Karachi",
        "Case Title": "Muhammad Siddique Mallah vs The Inspector General of Police Sindh and others",
        "Case Number": "Appeal No. 164 of 2021",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "FIR No.90/2017 dated 28.11.2017",
        "Legal Sections Involved": "Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Muhammad Siddique Mallah; Respondents: The Inspector General of Police Sindh, The Additional Inspector General of Police, Deputy Inspector General of Police, Senior Superintendent of Police",
        "Advocate Names for each party": "Appellant: Mr. Ghulam Sarwar Chandio; Respondents: Mr. Imran Ali Jatoi, Mr. Ayaz Rajpar, Mr. Juma Din, Mr. Tauseef, Mr. Anjum Nawaz, Mr. Asif Riaz",
        "Judge Name(s)": "Justice (R) Sadiq Hussain Bhatti, Tariq Mehmood Khoso, Dr. Khalil-ur-Rehman Shaikh",
        "Hearing Date": "02.08.2023",
        "Decision/Order Date": "02.08.2023",
        "Outcome of the Application": "Appeal allowed; impugned orders set aside; appellant reinstated in service",
        "Cited Case Laws": "2007 SCMR 229, 2009 SCMR 339",
        "Short Summary of the Case": "The appellant challenged his dismissal from service based on show cause notices issued under a repealed ordinance. The tribunal found the proceedings void ab-initio and reinstated the appellant."
    },
    {
        "source_file": "Appeal_No._189_of_2017.pdf",
        "Page count": 6,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Javeed Hussain Rajput vs. Province of Sindh and Inspector General Prisons",
        "Case Number": "APPEAL NO. 189 OF 2017",
        "Type of Petition or Application": "Appeal under section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Section 10 of the Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Javeed Hussain Rajput; Respondents: 1. Province of Sindh, 2. Inspector General Prisons",
        "Advocate Names for each party": "Mr. Ali Asadullah Bullo for the appellant; Mr. S. Kamil Shah, AAG Sindh for the respondents",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon",
        "Hearing Date": "10.05.2017",
        "Decision/Order Date": "05.06.2017",
        "Outcome of the Application": "Appeal allowed; appellant reinstated in service",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant challenged the removal from service imposed by the respondents, claiming he was not allowed to perform his duties as a Stenographer. The tribunal set aside the removal order and reinstated the appellant with conditions."
    },
    {
        "source_file": "Appeal_No._192_of_2018.pdf",
        "Page count": 3,
        "Court Name": "Sindh Service Tribunal",
        "Case Title": "Sarwar Shah S/o Sobdar Shah vs. The Inspector General of Police Sindh and The Additional Inspector General of Police",
        "Case Number": "Appeal No. 192 of 2018",
        "Type of Petition or Application": "Appeal",
        "FIR Number and Date": "Not mentioned in the document",
        "Legal Sections Involved": "Sindh Service Tribunals Act, 1973; Removal from Service (Special Powers) Sindh Ordinance, 2000",
        "Applicant and Respondents": "Applicant: Sarwar Shah; Respondents: The Inspector General of Police Sindh, The Additional Inspector General of Police",
        "Advocate Names for each party": "Appellant: Mr. Muala Buksh Khoso; Respondents: Mr. Asif Hussain Mangi, PI Muhammad Nawaz Minhas, PI Sajjad Abbasi",
        "Judge Name(s)": "Justice (R) Qaiser Iqbal, Shoukat Ali Memon, Iqbal Ahmad Soomro",
        "Hearing Date": "14.09.2018",
        "Decision/Order Date": "14.09.2018",
        "Outcome of the Application": "Appeal allowed; impugned orders set aside; appellant reinstated",
        "Cited Case Laws": "Not mentioned in the document",
        "Short Summary of the Case": "The appellant challenged the order of reduction in rank from ASI to HC, claiming the actions were taken under a repealed ordinance. The tribunal found the actions illegal and set aside the orders."
    },
